RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
  uint32_t AHBCLKDivider;         /*!< The AHB/AXI clock divider for HCLK.
                                       This clock is derived from the system clock divided by the system clock divider.
                                       This parameter can be a value of @ref RCC_HCLK_Clock_Source                        */

  uint32_t APB1CLKDivider;        /*!< The APB1 clock divider for PCLK1.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB1_Clock_Source                        */

  uint32_t APB2CLKDivider;        /*!< The APB2 clock divider for PCLK2.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB2_Clock_Source                        */

  uint32_t APB4CLKDivider;        /*!< The APB4 clock divider for PCLK4.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB4_Clock_Source                        */

  uint32_t APB5CLKDivider;        /*!< The APB5 clock divider for PCLK5.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB5_Clock_Source                        */

} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Oscillator_Type  Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        0x00000000U  /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE         0x00000001U  /*!< HSE selected */
#define RCC_OSCILLATORTYPE_HSI         0x00000002U  /*!< HSI selected */
#define RCC_OSCILLATORTYPE_LSE         0x00000004U  /*!< LSE selected */
#define RCC_OSCILLATORTYPE_LSI         0x00000008U  /*!< LSI selected */
#define RCC_OSCILLATORTYPE_CSI         0x00000010U  /*!< CSI selected */
#define RCC_OSCILLATORTYPE_HSI48       0x00000020U  /*!< HSI48 selected */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config  HSE Config
  * @{
  */
#define RCC_HSE_OFF                    0U                                                 /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_CR_HSEON                                       /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 (RCC_CR_HSEBYP | RCC_CR_HSEON)                     /*!< HSE bypass analog clock activation */
#define RCC_HSE_BYPASS_DIGITAL         (RCC_CR_HSEEXT | RCC_CR_HSEBYP | RCC_CR_HSEON)     /*!< HSE bypass digital clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config  LSE Config
  * @{
  */
#define RCC_LSE_OFF                    0U                                                   /*!< LSE clock deactivation */
#define RCC_LSE_ON                     RCC_BDCR_LSEON                                       /*!< LSE clock activation */
#define RCC_LSE_BYPASS                 (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)                   /*!< LSE bypass analog clock activation */
#define RCC_LSE_BYPASS_DIGITAL         (RCC_BDCR_LSEEXT | RCC_BDCR_LSEBYP | RCC_BDCR_LSEON) /*!< LSE bypass digital clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config  HSI Config
  * @{
  */
#define RCC_HSI_OFF                    0U                                    /*!< HSI clock deactivation */
#define RCC_HSI_ON                     RCC_CR_HSION                          /*!< HSI clock activation with divider 1 = 64MHz */
/**
  * @}
  */

/** @defgroup RCC_HSI_Calibration_Default  HSI Calibration default
  * @{
  */
#define RCC_HSICALIBRATION_DEFAULT     0x40U               /*!< Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_HSI_Divider  HSI Divider
  * @{
  */
#define RCC_HSI_DIV1                   0U                  /*!< HSI clock activation with divider 1 = 64MHz */
#define RCC_HSI_DIV2                   RCC_CR_HSIDIV_0     /*!< HSI clock activation with divider 2 = 32MHz */
#define RCC_HSI_DIV4                   RCC_CR_HSIDIV_1     /*!< HSI clock activation with divider 4 = 16MHz */
#define RCC_HSI_DIV8                   RCC_CR_HSIDIV       /*!< HSI clock activation with divider 8 = 8MHz */
/**
  * @}
  */

/** @defgroup RCC_HSI48_Config  HSI48 Config
  * @{
  */
#define RCC_HSI48_OFF                  0U                  /*!< HSI48 clock deactivation */
#define RCC_HSI48_ON                   RCC_CR_HSI48ON      /*!< HSI48 clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config  LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0U                  /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CSR_LSION       /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_CSI_Config  CSI Config
  * @{
  */
#define RCC_CSI_OFF                    0U                  /*!< CSI clock deactivation */
#define RCC_CSI_ON                     RCC_CR_CSION        /*!< CSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_CSI_Calibration_Default  CSI Calibration default
  * @{
  */
#define RCC_CSICALIBRATION_DEFAULT     0x20U               /*!< Default CSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config  PLL Config
  * @{
  */
#define RCC_PLL_NONE                   0U                  /*!< PLL configuration unchanged */
#define RCC_PLL_OFF                    1U                  /*!< PLL deactivation */
#define RCC_PLL_ON                     2U                  /*!< PLL activation */
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Source  PLL Clock Source
  * @{
  */
#define RCC_PLLSOURCE_HSI              0U                     /*!< HSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_CSI              RCC_PLLCKSELR_PLLSRC_0 /*!< CSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_HSE              RCC_PLLCKSELR_PLLSRC_1 /*!< HSE clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_NONE             RCC_PLLCKSELR_PLLSRC   /*!< No clock selected as PLL entry clock source  */
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Output  PLL Clock Output
  * @{
  */
#define RCC_PLL_PCLK                  RCC_PLLCFGR_PLL1PEN   /*!< PLL DIVP divider output enable */
#define RCC_PLL_QCLK                  RCC_PLLCFGR_PLL1QEN   /*!< PLL DIVQ divider output enable */
#define RCC_PLL_RCLK                  RCC_PLLCFGR_PLL1REN   /*!< PLL DIVR divider output enable */
#define RCC_PLL_SCLK                  RCC_PLLCFGR_PLL1SEN   /*!< PLL DIVS divider output enable */
#define RCC_PLL_TCLK                  0x00000200U           /*!< PLL DIVT divider output enable, hardcoded because no definition in CMSIS */
/**
  * @}
  */

