RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
/** @defgroup RCC_PLL_VCI_Range  PLL VCI Range
  * @{
  */
#define RCC_PLL_VCOINPUT_RANGE0             0U                    /*!< Clock range frequency for PLL between 1 and 2 MHz (reset) */
#define RCC_PLL_VCOINPUT_RANGE1             RCC_PLLCFGR_PLL1RGE_0 /*!< Clock range frequency for PLL between 2 and 4 MHz  */
#define RCC_PLL_VCOINPUT_RANGE2             RCC_PLLCFGR_PLL1RGE_1 /*!< Clock range frequency for PLL between 4 and 8 MHz  */
#define RCC_PLL_VCOINPUT_RANGE3             RCC_PLLCFGR_PLL1RGE   /*!< Clock range frequency for PLL between 8 and 16 MHz */
/**
  * @}
  */

/** @defgroup RCC_PLL_VCO_Range  PLL VCO Range
  * @{
  */
#define RCC_PLL_VCO_HIGH                    0U                       /*!< Wide PLL VCO output range between 400 and 1600 MHz (reset) */
#define RCC_PLL_VCO_LOW                     RCC_PLLCFGR_PLL1VCOSEL   /*!< Low PLL VCO output range between 150 and 420 MHz        */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Type  System Clock Type
  * @{
  */
#define RCC_CLOCKTYPE_SYSCLK           0x00000001U         /*!< SYSCLK to configure */
#define RCC_CLOCKTYPE_HCLK             0x00000002U         /*!< HCLK to configure */
#define RCC_CLOCKTYPE_PCLK1            0x00000004U         /*!< PCLK1 to configure */
#define RCC_CLOCKTYPE_PCLK2            0x00000008U         /*!< PCLK2 to configure */
#define RCC_CLOCKTYPE_PCLK4            0x00000010U         /*!< PCLK4 to configure */
#define RCC_CLOCKTYPE_PCLK5            0x00000020U         /*!< PCLK5 to configure */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source  System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSI           0U                  /*!< HSI selection as system clock */
#define RCC_SYSCLKSOURCE_CSI           RCC_CFGR_SW_0       /*!< CSI selection as system clock */
#define RCC_SYSCLKSOURCE_HSE           RCC_CFGR_SW_1       /*!< HSE selection as system clock */
#define RCC_SYSCLKSOURCE_PLLCLK        (RCC_CFGR_SW_1 | RCC_CFGR_SW_0) /*!< PLL1 selection as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSI    0U                  /*!< HSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_CSI    RCC_CFGR_SWS_0      /*!< CSI used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSE    RCC_CFGR_SWS_1      /*!< HSE used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_PLLCLK (RCC_CFGR_SWS_1 | RCC_CFGR_SWS_0) /*!< PLL1 used as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Divider  System Clock Divider
  * @{
  */
#define RCC_SYSCLK_DIV1      0U                                                          /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2      RCC_CDCFGR_CPRE_3                                           /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4      (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_0)                     /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8      (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_1)                     /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16     (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_1 | RCC_CDCFGR_CPRE_0) /*!< SYSCLK divided by 16 */
#define RCC_SYSCLK_DIV64     (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2)                     /*!< SYSCLK divided by 64 */
#define RCC_SYSCLK_DIV128    (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2 | RCC_CDCFGR_CPRE_0) /*!< SYSCLK divided by 128 */
#define RCC_SYSCLK_DIV256    (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2 | RCC_CDCFGR_CPRE_1) /*!< SYSCLK divided by 256 */
#define RCC_SYSCLK_DIV512    (RCC_CDCFGR_CPRE_3 | RCC_CDCFGR_CPRE_2 | RCC_CDCFGR_CPRE_1 | RCC_CDCFGR_CPRE_0) /*!< SYSCLK divided by 512 */
/**
  * @}
  */


/** @defgroup RCC_HCLK_Clock_Source  HCLK Clock Source
  * @{
  */
#define RCC_HCLK_DIV1        0U                                                             /*!< HCLK not divided */
#define RCC_HCLK_DIV2        RCC_BMCFGR_BMPRE_3                                             /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4        (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_0)                      /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8        (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_1)                      /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16       (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_1 | RCC_BMCFGR_BMPRE_0) /*!< HCLK divided by 16 */
#define RCC_HCLK_DIV64       (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2)                      /*!< HCLK divided by 64 */
#define RCC_HCLK_DIV128      (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2 | RCC_BMCFGR_BMPRE_0) /*!< HCLK divided by 128 */
#define RCC_HCLK_DIV256      (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2 | RCC_BMCFGR_BMPRE_1) /*!< HCLK divided by 256 */
#define RCC_HCLK_DIV512      (RCC_BMCFGR_BMPRE_3 | RCC_BMCFGR_BMPRE_2 | RCC_BMCFGR_BMPRE_1 | RCC_BMCFGR_BMPRE_0) /*!< HCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Source  APB1 Clock Source
  * @{
  */
#define RCC_APB1_DIV1        0U                                                    /*!< APB1 not divided */
#define RCC_APB1_DIV2        RCC_APBCFGR_PPRE1_2                                   /*!< APB1 divided by 2 */
#define RCC_APB1_DIV4        (RCC_APBCFGR_PPRE1_2 | RCC_APBCFGR_PPRE1_0)           /*!< APB1 divided by 4 */
#define RCC_APB1_DIV8        (RCC_APBCFGR_PPRE1_2 | RCC_APBCFGR_PPRE1_1)           /*!< APB1 divided by 8 */
#define RCC_APB1_DIV16       RCC_APBCFGR_PPRE1                                     /*!< APB1 divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Source  APB2 Clock Source
  * @{
  */
#define RCC_APB2_DIV1        0U                                                    /*!< APB2 not divided */
#define RCC_APB2_DIV2        RCC_APBCFGR_PPRE2_2                                   /*!< APB2 divided by 2 */
#define RCC_APB2_DIV4        (RCC_APBCFGR_PPRE2_2 | RCC_APBCFGR_PPRE2_0)           /*!< APB2 divided by 4 */
#define RCC_APB2_DIV8        (RCC_APBCFGR_PPRE2_2 | RCC_APBCFGR_PPRE2_1)           /*!< APB2 divided by 8 */
#define RCC_APB2_DIV16       RCC_APBCFGR_PPRE2                                     /*!< APB2 divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB4_Clock_Source  APB4 Clock Source
  * @{
  */
#define RCC_APB4_DIV1        0U                                                    /*!< APB4 not divided */
#define RCC_APB4_DIV2        RCC_APBCFGR_PPRE4_2                                   /*!< APB4 divided by 2 */
#define RCC_APB4_DIV4        (RCC_APBCFGR_PPRE4_2 | RCC_APBCFGR_PPRE4_0)           /*!< APB4 divided by 4 */
#define RCC_APB4_DIV8        (RCC_APBCFGR_PPRE4_2 | RCC_APBCFGR_PPRE4_1)           /*!< APB4 divided by 8 */
#define RCC_APB4_DIV16       RCC_APBCFGR_PPRE4                                     /*!< APB4 divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB5_Clock_Source  APB5 Clock Source
  * @{
  */
#define RCC_APB5_DIV1        0U                                                    /*!< APB5 not divided */
#define RCC_APB5_DIV2        RCC_APBCFGR_PPRE5_2                                   /*!< APB5 divided by 2 */
#define RCC_APB5_DIV4        (RCC_APBCFGR_PPRE5_2 | RCC_APBCFGR_PPRE5_0)           /*!< APB5 divided by 4 */
#define RCC_APB5_DIV8        (RCC_APBCFGR_PPRE5_2 | RCC_APBCFGR_PPRE5_1)           /*!< APB5 divided by 8 */
#define RCC_APB5_DIV16       RCC_APBCFGR_PPRE5                                     /*!< APB5 divided by 16 */
/**
  * @}
  */

