RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
/* @cond */
/* 32     28      20       16      0
   --------------------------------
   | MCO   | GPIO  | GPIO  | GPIO  |
   | Index |  AF   | Port  |  Pin  |
   -------------------------------*/

#define RCC_MCO_GPIOPORT_POS   16U
#define RCC_MCO_GPIOPORT_MASK  (0xFUL << RCC_MCO_GPIOPORT_POS)
#define RCC_MCO_GPIOAF_POS     20U
#define RCC_MCO_GPIOAF_MASK    (0xFFUL << RCC_MCO_GPIOAF_POS)
#define RCC_MCO_INDEX_POS      28U
#define RCC_MCO_INDEX_MASK     (0x1UL << RCC_MCO_INDEX_POS)

#define RCC_MCO1_INDEX         (0x0UL << RCC_MCO_INDEX_POS)             /*!< MCO1 index */
#define RCC_MCO2_INDEX         (0x1UL << RCC_MCO_INDEX_POS)             /*!< MCO2 index */
/* @endcond */

#define RCC_MCO1_PA8           (RCC_MCO1_INDEX |\
                                (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | (GPIO_GET_INDEX(GPIOA) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_8)
#define RCC_MCO1               RCC_MCO1_PA8         /*!< Alias for compatibility */

#define RCC_MCO2_PC9           (RCC_MCO2_INDEX |\
                                (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | (GPIO_GET_INDEX(GPIOC) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_9)
#define RCC_MCO2               RCC_MCO2_PC9         /*!< Alias for compatibility */

#define RCC_MCO                RCC_MCO1             /*!< MCO1 to be compliant with other families with 1 MCO*/
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source  MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_HSI             0U                                        /*!< HSI clock selected as MCO1 source (reset) */
#define RCC_MCO1SOURCE_LSE             RCC_CFGR_MCO1SEL_0                        /*!< LSE clock selected as MCO1 source */
#define RCC_MCO1SOURCE_HSE             RCC_CFGR_MCO1SEL_1                        /*!< HSE clock selected as MCO1 source */
#define RCC_MCO1SOURCE_PLL1Q           (RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_0) /*!< PLL1Q clock selected as MCO1 source */
#define RCC_MCO1SOURCE_HSI48           RCC_CFGR_MCO1SEL_2                        /*!< HSI48 clock selected as MCO1 source */
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Source  MCO2 Clock Source
  * @{
  */
#define RCC_MCO2SOURCE_SYSCLK          0U                                        /*!< System clock selected as MCO2 source (reset) */
#define RCC_MCO2SOURCE_PLL2P           RCC_CFGR_MCO2SEL_0                        /*!< PLL2P clock selected as MCO2 source */
#define RCC_MCO2SOURCE_HSE             RCC_CFGR_MCO2SEL_1                        /*!< HSE clock selected as MCO2 source */
#define RCC_MCO2SOURCE_PLL1P           (RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_0) /*!< PLL1P clock selected as MCO2 source */
#define RCC_MCO2SOURCE_CSI             RCC_CFGR_MCO2SEL_2                        /*!< CSI clock selected as MCO2 source */
#define RCC_MCO2SOURCE_LSI             (RCC_CFGR_MCO2SEL_2 | RCC_CFGR_MCO2SEL_0) /*!< LSI clock selected as MCO2 source */
/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler  MCOx Clock Prescaler
  * @{
  */
#define RCC_MCODIV_NONE                0U                                                             /*!< No MCO prescaler (reset) */
#define RCC_MCODIV_1                   RCC_CFGR_MCO1PRE_0                                             /*!< MCO divided by 1 */
#define RCC_MCODIV_2                   RCC_CFGR_MCO1PRE_1                                             /*!< MCO divided by 2 */
#define RCC_MCODIV_3                   (RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 3 */
#define RCC_MCODIV_4                   RCC_CFGR_MCO1PRE_2                                             /*!< MCO divided by 4 */
#define RCC_MCODIV_5                   (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 5 */
#define RCC_MCODIV_6                   (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_1)                      /*!< MCO divided by 6 */
#define RCC_MCODIV_7                   (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_0) /*!< MCO divided by 7 */
#define RCC_MCODIV_8                   RCC_CFGR_MCO1PRE_3                                             /*!< MCO divided by 8 */
#define RCC_MCODIV_9                   (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 9 */
#define RCC_MCODIV_10                  (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_1)                      /*!< MCO divided by 10 */
#define RCC_MCODIV_11                  (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_0) /*!< MCO divided by 11 */
#define RCC_MCODIV_12                  (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_2)                      /*!< MCO divided by 12 */
#define RCC_MCODIV_13                  (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_0) /*!< MCO divided by 13 */
#define RCC_MCODIV_14                  (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_1) /*!< MCO divided by 14 */
#define RCC_MCODIV_15                  RCC_CFGR_MCO1PRE                                               /*!< MCO divided by 15 */
/**
  * @}
  */

/** @defgroup RCC_Interrupt  Interrupt
  * @{
  */
#define RCC_IT_LSIRDY                  RCC_CIFR_LSIRDYF    /*!< LSI Ready Interrupt */
#define RCC_IT_LSERDY                  RCC_CIFR_LSERDYF    /*!< LSE Ready Interrupt */
#define RCC_IT_HSIRDY                  RCC_CIFR_HSIRDYF    /*!< HSI Ready Interrupt */
#define RCC_IT_HSERDY                  RCC_CIFR_HSERDYF    /*!< HSE Ready Interrupt */
#define RCC_IT_CSIRDY                  RCC_CIFR_CSIRDYF    /*!< CSI Ready Interrupt */
#define RCC_IT_HSI48RDY                RCC_CIFR_HSI48RDYF  /*!< HSI48 Ready Interrupt */
#define RCC_IT_PLL1RDY                 RCC_CIFR_PLL1RDYF   /*!< PLL1 Ready Interrupt */
#define RCC_IT_PLL2RDY                 RCC_CIFR_PLL2RDYF   /*!< PLL2 Ready Interrupt */
#define RCC_IT_PLL3RDY                 RCC_CIFR_PLL3RDYF   /*!< PLL3 Ready Interrupt */
#define RCC_IT_LSECSS                  RCC_CIFR_LSECSSF    /*!< LSE Clock Security System Interrupt */
#define RCC_IT_HSECSS                  RCC_CIFR_HSECSSF    /*!< HSE Clock Security System Interrupt (flag only) */
/**
  * @}
  */

/** @defgroup RCC_Flag  Flag
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  *                 - 100: RSR register
  * @{
  */
#define RCC_FLAG_HSIRDY                ((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos)     /*!< HSI Ready flag */
#define RCC_FLAG_HSIDIV                ((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSIDIVF_Pos)    /*!< HSIDIV Ready flag */
#define RCC_FLAG_CSIRDY                ((RCC_CR_REG_INDEX << 5U) | RCC_CR_CSIRDY_Pos)     /*!< CSI Ready flag */
#define RCC_FLAG_HSI48RDY              ((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSI48RDY_Pos)   /*!< HSI48 Ready flag */
#define RCC_FLAG_HSERDY                ((RCC_CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos)     /*!< HSE Ready flag */
#define RCC_FLAG_PLL1RDY               ((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL1RDY_Pos)    /*!< PLL1 Ready flag */
#define RCC_FLAG_PLL2RDY               ((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL2RDY_Pos)    /*!< PLL2 Ready flag */
#define RCC_FLAG_PLL3RDY               ((RCC_CR_REG_INDEX << 5U) | RCC_CR_PLL3RDY_Pos)    /*!< PLL3 Ready flag */

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY                ((RCC_BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos)  /*!< LSE Ready flag */
#define RCC_FLAG_LSECSSD               ((RCC_BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos) /*!< LSE Clock Security System failure detection flag */

