RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
/* Flags in the CSR register */
#define RCC_FLAG_LSIRDY                ((RCC_CSR_REG_INDEX << 5U) | RCC_CSR_LSIRDY_Pos)   /*!< LSI Ready flag */

/* Flags in the RSR register */
#define RCC_FLAG_BORRST                ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_BORRSTF_Pos)  /*!< BOR reset flag */
#define RCC_FLAG_PINRST                ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_PINRSTF_Pos)  /*!< PIN reset flag */
#define RCC_FLAG_PORRST                ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_PORRSTF_Pos)  /*!< Power-on reset flag */
#define RCC_FLAG_SFTRST                ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_SFTRSTF_Pos)  /*!< Software Reset flag */
#define RCC_FLAG_IWDGRST               ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_IWDGRSTF_Pos) /*!< Independent Watchdog reset flag */
#define RCC_FLAG_WWDGRST               ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_WWDGRSTF_Pos) /*!< Window watchdog reset flag */
#define RCC_FLAG_LPWRRST               ((RCC_RSR_REG_INDEX << 5U) | RCC_RSR_LPWRRSTF_Pos) /*!< Low-Power reset flag */
/**
  * @}
  */

/** @defgroup RCC_LSEDrive_Config LSE Drive Config
  * @{
  */
#define RCC_LSEDRIVE_LOW               0U                  /*!< LSE low drive capability */
#define RCC_LSEDRIVE_MEDIUMLOW         RCC_BDCR_LSEDRV_0   /*!< LSE medium low drive capability */
#define RCC_LSEDRIVE_MEDIUMHIGH        RCC_BDCR_LSEDRV_1   /*!< LSE medium high drive capability */
#define RCC_LSEDRIVE_HIGH              RCC_BDCR_LSEDRV     /*!< LSE high drive capability */
/**
  * @}
  */

/** @defgroup RCC_Reset_Flag Reset Flag
  * @{
  */
#define RCC_RESET_FLAG_OBL              RCC_RSR_OBLRSTF    /*!< Option Byte Loader reset flag */
#define RCC_RESET_FLAG_PIN              RCC_RSR_PINRSTF    /*!< PIN reset flag */
#define RCC_RESET_FLAG_PWR              RCC_RSR_BORRSTF    /*!< BOR or POR/PDR reset flag */
#define RCC_RESET_FLAG_SW               RCC_RSR_SFTRSTF    /*!< Software Reset flag */
#define RCC_RESET_FLAG_IWDG             RCC_RSR_IWDGRSTF   /*!< Independent Watchdog reset flag */
#define RCC_RESET_FLAG_WWDG             RCC_RSR_WWDGRSTF   /*!< Window watchdog reset flag */
#define RCC_RESET_FLAG_LPWR             RCC_RSR_LPWRRSTF   /*!< Low power reset flag */
#define RCC_RESET_FLAG_ALL              (RCC_RESET_FLAG_OBL | RCC_RESET_FLAG_PIN | RCC_RESET_FLAG_PWR | \
                                         RCC_RESET_FLAG_SW | RCC_RESET_FLAG_IWDG | RCC_RESET_FLAG_WWDG | \
                                         RCC_RESET_FLAG_LPWR)
/**
  * @}
  */

/** @defgroup RCC_Stop_WakeUpClock  Stop WakeUp Clock
  * @{
  */
#define RCC_STOP_WAKEUPCLOCK_HSI       0U                  /*!< HSI selected as wake up system clock from system Stop (default after reset) */
#define RCC_STOP_WAKEUPCLOCK_CSI       RCC_CFGR_STOPWUCK   /*!< CSI selected as wake up system clock from system Stop */
/**
  * @}
  */

/** @defgroup RCC_Stop_KernelWakeUpClock  Stop Kernel WakeUp Clock
  * @{
  */
#define RCC_STOP_KERWAKEUPCLOCK_HSI    0U                   /*!< HSI selected as wake up kernel clock from system Stop (default after reset) */
#define RCC_STOP_KERWAKEUPCLOCK_CSI    RCC_CFGR_STOPKERWUCK /*!< CSI selected as wake up kernel clock from system Stop */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/

/** @defgroup RCC_Exported_Macros RCC Exported Macros
  * @{
  */

/** @defgroup RCC_AXI_Clock_Gating_Enable_Disable AXI Interconnect, Master and Slave Clock Gating Enable Disable
  * @brief  Enable or disable the clock gating.
  * @note   The dynamic power consumption can be optimized by enabling the functional clock gating.
  *         After reset, the clock gating is enabled (except for JTAG if a JTAG connection has been detected).
  * @{
  */

#define __HAL_RCC_AXI_INTERCONNECT_CLK_GATING_ENABLE()      CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AXICKG)

#define __HAL_RCC_AXI_MASTER_AHB_CLK_GATING_ENABLE()        CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AHBCKG)

#define __HAL_RCC_AXI_MASTER_SDMMC1_CLK_GATING_ENABLE()     CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_SDMMCCKG)

#define __HAL_RCC_AXI_MASTER_HPDMA1_CLK_GATING_ENABLE()     CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_HPDMA1CKG)

#define __HAL_RCC_AXI_MASTER_CPU_CLK_GATING_ENABLE()        CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_CPUCKG)

#define __HAL_RCC_AXI_MASTER_GPU2D_0_CLK_GATING_ENABLE()    CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DS0CKG)

#define __HAL_RCC_AXI_MASTER_GPU2D_1_CLK_GATING_ENABLE()    CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DS1CKG)

#define __HAL_RCC_AXI_MASTER_GPU2D_CACHE_CLK_GATING_ENABLE() CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DCKG)

#define __HAL_RCC_AXI_MASTER_DCMIPP_CLK_GATING_ENABLE()     CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_DCMIPPCKG)

#define __HAL_RCC_AXI_MASTER_DMA2D_CLK_GATING_ENABLE()      CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_DMA2DCKG)

#define __HAL_RCC_AXI_MASTER_LTDC_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_LTDCCKG)

#define __HAL_RCC_AXI_MASTER_GFXMMU_CLK_GATING_ENABLE()     CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_GFXMMUMCKG)

#define __HAL_RCC_AXI_SLAVE_GFXMMU_CLK_GATING_ENABLE()      CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_GFXMMUSCKG)

#define __HAL_RCC_AXI_SLAVE_AHB_CLK_GATING_ENABLE()         CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AHBSCKG)

#define __HAL_RCC_AXI_SLAVE_FMC_CLK_GATING_ENABLE()         CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_FMCCKG)

#define __HAL_RCC_AXI_SLAVE_XSPI1_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_XSPI1CKG)

#define __HAL_RCC_AXI_SLAVE_XSPI2_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_XSPI2CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM0_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM0CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM1_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM1CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM2_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM2CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM3_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM3CKG)

#define __HAL_RCC_AXI_SLAVE_FLASH_CLK_GATING_ENABLE()       CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_FLIFTCKG)

#define __HAL_RCC_AXI_SLAVE_EXTI_CLK_GATING_ENABLE()        CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_EXTICKG)

#define __HAL_RCC_AXI_SLAVE_JTAG_CLK_GATING_ENABLE()        CLEAR_BIT(RCC->CKGDISR, RCC_CKGDISR_JTAGCKG)


#define __HAL_RCC_AXI_INTERCONNECT_CLK_GATING_DISABLE()     SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AXICKG)

#define __HAL_RCC_AXI_MASTER_AHB_CLK_GATING_DISABLE()       SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AHBCKG)

