RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_AXI_MASTER_SDMMC1_CLK_GATING_DISABLE()    SET_BIT(RCC->CKGDISR, RCC_CKGDISR_SDMMCCKG)

#define __HAL_RCC_AXI_MASTER_HPDMA1_CLK_GATING_DISABLE()    SET_BIT(RCC->CKGDISR, RCC_CKGDISR_HPDMA1CKG)

#define __HAL_RCC_AXI_MASTER_CPU_CLK_GATING_DISABLE()       SET_BIT(RCC->CKGDISR, RCC_CKGDISR_CPUCKG)

#define __HAL_RCC_AXI_MASTER_GPU_0_CLK_GATING_DISABLE()     SET_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DS0CKG)

#define __HAL_RCC_AXI_MASTER_GPU_1_CLK_GATING_DISABLE()     SET_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DS1CKG)

#define __HAL_RCC_AXI_MASTER_GPU_CACHE_CLK_GATING_DISABLE() SET_BIT(RCC->CKGDISR, RCC_CKGDISR_GPU2DCKG)

#define __HAL_RCC_AXI_MASTER_DCMIPP_CLK_GATING_DISABLE()    SET_BIT(RCC->CKGDISR, RCC_CKGDISR_DCMIPPCKG)

#define __HAL_RCC_AXI_MASTER_DMA2D_CLK_GATING_DISABLE()     SET_BIT(RCC->CKGDISR, RCC_CKGDISR_DMA2DCKG)

#define __HAL_RCC_AXI_MASTER_LTDC_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_LTDCCKG)

#define __HAL_RCC_AXI_MASTER_GFXMMU_CLK_GATING_DISABLE()    SET_BIT(RCC->CKGDISR, RCC_CKGDISR_GFXMMUMCKG)

#define __HAL_RCC_AXI_SLAVE_GFXMMU_CLK_GATING_DISABLE()     SET_BIT(RCC->CKGDISR, RCC_CKGDISR_GFXMMUSCKG)

#define __HAL_RCC_AXI_SLAVE_AHB_CLK_GATING_DISABLE()        SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AHBSCKG)

#define __HAL_RCC_AXI_SLAVE_FMC_CLK_GATING_DISABLE()        SET_BIT(RCC->CKGDISR, RCC_CKGDISR_FMCCKG)

#define __HAL_RCC_AXI_SLAVE_XSPI1_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_XSPI1CKG)

#define __HAL_RCC_AXI_SLAVE_XSPI2_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_XSPI2CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM0_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM0CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM1_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM1CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM2_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM2CKG)

#define __HAL_RCC_AXI_SLAVE_SRAM3_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_AXISRAM3CKG)

#define __HAL_RCC_AXI_SLAVE_FLASH_CLK_GATING_DISABLE()      SET_BIT(RCC->CKGDISR, RCC_CKGDISR_FLIFTCKG)

#define __HAL_RCC_AXI_SLAVE_EXTI_CLK_GATING_DISABLE()       SET_BIT(RCC->CKGDISR, RCC_CKGDISR_EXTICKG)

#define __HAL_RCC_AXI_SLAVE_JTAG_CLK_GATING_DISABLE()       SET_BIT(RCC->CKGDISR, RCC_CKGDISR_JTAGCKG)

/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_GPDMA1_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPDMA1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_ADC12_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADC12EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#if defined(ETH)
#define __HAL_RCC_ETH1MAC_CLK_ENABLE() do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1MACEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_ETH1TX_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1TXEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_ETH1RX_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1RXEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_CLK_ENABLE() do { \
                                                __IO uint32_t tmpreg; \
                                                SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN);\
                                                /* Delay after an RCC peripheral clock enabling */ \
                                                tmpreg = READ_REG(RCC->AHB1ENR);\
                                                UNUSED(tmpreg); \
                                              } while(0)

#define __HAL_RCC_USB_OTG_FS_CLK_ENABLE() do { \
                                                __IO uint32_t tmpreg; \
                                                SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGFSEN);\
                                                /* Delay after an RCC peripheral clock enabling */ \
                                                tmpreg = READ_REG(RCC->AHB1ENR);\
                                                UNUSED(tmpreg); \
                                              } while(0)

#define __HAL_RCC_USBPHYC_CLK_ENABLE() do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_USBPHYCEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_ADF1_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADF1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB1ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)


