RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_GPDMA1_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPDMA1EN)

#define __HAL_RCC_ADC12_CLK_DISABLE()  CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADC12EN)

#if defined(ETH)
#define __HAL_RCC_ETH1MAC_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1MACEN)

#define __HAL_RCC_ETH1TX_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1TXEN)

#define __HAL_RCC_ETH1RX_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1RXEN)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN)

#define __HAL_RCC_USB_OTG_FS_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGFSEN)

#define __HAL_RCC_USBPHYC_CLK_DISABLE() CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_USBPHYCEN)

#define __HAL_RCC_ADF1_CLK_DISABLE()   CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADF1EN)

/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Enable_Disable AHB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_PSSI_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_PSSIEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SDMMC2_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SDMMC2EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_CORDIC_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_CORDICEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SRAM1_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SRAM2_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM2EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_PSSI_CLK_DISABLE()   CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_PSSIEN)

#define __HAL_RCC_SDMMC2_CLK_DISABLE() CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SDMMC2EN)

#define __HAL_RCC_CORDIC_CLK_DISABLE() CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_CORDICEN)

#define __HAL_RCC_SRAM1_CLK_DISABLE()  CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM1EN)

#define __HAL_RCC_SRAM2_CLK_DISABLE()  CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM2EN)

/**
  * @}
  */

/** @defgroup RCC_AHB3_Peripheral_Clock_Enable_Disable AHB3 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB3 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_RNG_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_RNGEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB3ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_HASH_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_HASHEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB3ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#if defined(CRYP)
#define __HAL_RCC_CRYP_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_CRYPEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB3ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_SAESEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB3ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* SAES */

