RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#if defined(PKA)
#define __HAL_RCC_PKA_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB3ENR, RCC_AHB3ENR_PKAEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB3ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* PKA */

#define __HAL_RCC_RNG_CLK_DISABLE()    CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_RNGEN)

#define __HAL_RCC_HASH_CLK_DISABLE()   CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_HASHEN)

#if defined(CRYP)
#define __HAL_RCC_CRYP_CLK_DISABLE()   CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_CRYPEN)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_CLK_DISABLE()   CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_SAESEN)
#endif /* SAES */

#if defined(PKA)
#define __HAL_RCC_PKA_CLK_DISABLE()    CLEAR_BIT(RCC->AHB3ENR, RCC_AHB3ENR_PKAEN)
#endif /* PKA */

/**
  * @}
  */

/** @defgroup RCC_AHB4_Peripheral_Clock_Enable_Disable AHB4 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB4 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_GPIOA_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOAEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOB_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOBEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOC_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOCEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOD_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIODEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOE_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOEEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOF_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOFEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOG_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOGEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOH_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOHEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOM_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOMEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPION_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIONEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOO_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOOEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GPIOP_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOPEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_CRC_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_CRCEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_BKPRAM_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB4ENR, RCC_AHB4ENR_BKPRAMEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)


#define __HAL_RCC_GPIOA_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOAEN)

