RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_GPIOB_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOBEN)

#define __HAL_RCC_GPIOC_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOCEN)

#define __HAL_RCC_GPIOD_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIODEN)

#define __HAL_RCC_GPIOE_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOEEN)

#define __HAL_RCC_GPIOF_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOFEN)

#define __HAL_RCC_GPIOG_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOGEN)

#define __HAL_RCC_GPIOH_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOHEN)

#define __HAL_RCC_GPIOM_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOMEN)

#define __HAL_RCC_GPION_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIONEN)

#define __HAL_RCC_GPIOO_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOOEN)

#define __HAL_RCC_GPIOP_CLK_DISABLE()  CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOPEN)

#define __HAL_RCC_CRC_CLK_DISABLE()    CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_CRCEN)

#define __HAL_RCC_BKPRAM_CLK_DISABLE() CLEAR_BIT(RCC->AHB4ENR, RCC_AHB4ENR_BKPRAMEN)

/**
  * @}
  */

/** @defgroup RCC_AHB5_Peripheral_Clock_Enable_Disable AHB5 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB5 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_HPDMA1_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_HPDMA1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_DMA2D_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_DMA2DEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#if defined(JPEG)
#define __HAL_RCC_JPEG_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_JPEGEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* JPEG */

#define __HAL_RCC_FMC_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_FMCEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_XSPI1_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPI1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SDMMC1_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_SDMMC1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_XSPI2_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPI2EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_XSPIM_CLK_ENABLE() do { \
                                          __IO uint32_t tmpreg; \
                                          SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPIMEN);\
                                          /* Delay after an RCC peripheral clock enabling */ \
                                          tmpreg = READ_REG(RCC->AHB5ENR);\
                                          UNUSED(tmpreg); \
                                        } while(0)

#if defined(GFXMMU)
#define __HAL_RCC_GFXMMU_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_GFXMMUEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* GFXMMU */

#if defined(GPU2D)
#define __HAL_RCC_GPU2D_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->AHB5ENR, RCC_AHB5ENR_GPU2DEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->AHB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)
#endif /* GPU2D */

