RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_HPDMA1_CLK_DISABLE() CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_HPDMA1EN)

#define __HAL_RCC_DMA2D_CLK_DISABLE()  CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_DMA2DEN)

#if defined(JPEG)
#define __HAL_RCC_JPEG_CLK_DISABLE()   CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_JPEGEN)
#endif /* JPEG */

#define __HAL_RCC_FMC_CLK_DISABLE()    CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_FMCEN)

#define __HAL_RCC_XSPI1_CLK_DISABLE()  CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPI1EN)

#define __HAL_RCC_SDMMC1_CLK_DISABLE() CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_SDMMC1EN)

#define __HAL_RCC_XSPI2_CLK_DISABLE()  CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPI2EN)

#define __HAL_RCC_XSPIM_CLK_DISABLE() CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_XSPIMEN)

#if defined(GFXMMU)
#define __HAL_RCC_GFXMMU_CLK_DISABLE() CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_GFXMMUEN)
#endif /* GFXMMU */

#if defined(GPU2D)
#define __HAL_RCC_GPU2D_CLK_DISABLE()  CLEAR_BIT(RCC->AHB5ENR, RCC_AHB5ENR_GPU2DEN)
#endif /* GPU2D */

/**
  * @}
  */

/** @defgroup RCC_APB1_Peripheral_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_TIM2_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM3_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM4_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM5_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM5EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM6_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM7_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM12_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM12EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM13_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM13EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM14_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM14EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_LPTIM1_CLK_ENABLE() do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_WWDG_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_WWDGEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_SPI2_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_SPI3_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_SPDIFRX_CLK_ENABLE() do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPDIFRXEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB1ENR1);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_USART2_CLK_ENABLE() do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_USART3_CLK_ENABLE() do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

