RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_UART4_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_UART5_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_I2C1_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1_I3C1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_I2C2_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_I2C3_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_I3C1_CLK_ENABLE()   do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1_I3C1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_CEC_CLK_ENABLE()    do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CECEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_UART7_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART7EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_UART8_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART8EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_CRS_CLK_ENABLE()    do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_CRSEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_MDIOS_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_MDIOSEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_FDCAN_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_FDCANEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_UCPD1_CLK_ENABLE()  do { \
                                           __IO uint32_t tmpreg; \
                                           SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_UCPD1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_REG(RCC->APB1ENR1);\
                                           UNUSED(tmpreg); \
                                         } while(0)

#define __HAL_RCC_TIM2_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN)

#define __HAL_RCC_TIM3_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN)

#define __HAL_RCC_TIM4_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN)

#define __HAL_RCC_TIM5_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM5EN)

#define __HAL_RCC_TIM6_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN)

