RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_TIM7_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN)

#define __HAL_RCC_TIM12_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM12EN)

#define __HAL_RCC_TIM13_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM13EN)

#define __HAL_RCC_TIM14_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM14EN)

#define __HAL_RCC_LPTIM1_CLK_DISABLE() CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_LPTIM1EN)

#define __HAL_RCC_SPI2_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN)

#define __HAL_RCC_SPI3_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN)

#define __HAL_RCC_SPDIFRX_CLK_DISABLE() CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPDIFRXEN)

#define __HAL_RCC_USART2_CLK_DISABLE() CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN)

#define __HAL_RCC_USART3_CLK_DISABLE() CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN)

#define __HAL_RCC_UART4_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN)

#define __HAL_RCC_UART5_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN)

#define __HAL_RCC_I2C1_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1_I3C1EN)

#define __HAL_RCC_I2C2_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN)

#define __HAL_RCC_I2C3_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C3EN)

#define __HAL_RCC_I3C1_CLK_DISABLE()   CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1_I3C1EN)

#define __HAL_RCC_CEC_CLK_DISABLE()    CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CECEN)

#define __HAL_RCC_UART7_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART7EN)

#define __HAL_RCC_UART8_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART8EN)

#define __HAL_RCC_CRS_CLK_DISABLE()    CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_CRSEN)

#define __HAL_RCC_MDIOS_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_MDIOSEN)

#define __HAL_RCC_FDCAN_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_FDCANEN)

#define __HAL_RCC_UCPD1_CLK_DISABLE()  CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_UCPD1EN)

/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_TIM1_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_USART1_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SPI1_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SPI4_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_TIM15_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_TIM16_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_TIM17_CLK_ENABLE()   do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_TIM9_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM9EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SPI5_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI5EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SAI1_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SAI2_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB2ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_TIM1_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN)

#define __HAL_RCC_USART1_CLK_DISABLE() CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN)

