RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_SPI1_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN)

#define __HAL_RCC_SPI4_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN)

#define __HAL_RCC_TIM15_CLK_DISABLE()  CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN)

#define __HAL_RCC_TIM16_CLK_DISABLE()  CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN)

#define __HAL_RCC_TIM17_CLK_DISABLE()  CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN)

#define __HAL_RCC_TIM9_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM9EN)

#define __HAL_RCC_SPI5_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI5EN)

#define __HAL_RCC_SAI1_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN)

#define __HAL_RCC_SAI2_CLK_DISABLE()   CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN)

/**
  * @}
  */

/** @defgroup RCC_APB4_Peripheral_Clock_Enable_Disable APB4 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB4 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_SBS_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_SBSEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LPUART1_CLK_ENABLE() do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_LPUART1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SPI6_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_SPI6EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LPTIM2_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM2EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LPTIM3_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM3EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LPTIM4_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM4EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LPTIM5_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM5EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_VREF_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_VREFEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_RTCAPB_CLK_ENABLE()     do { \
                                               __IO uint32_t tmpreg; \
                                               SET_BIT(RCC->APB4ENR, RCC_APB4ENR_RTCAPBEN);\
                                               /* Delay after an RCC peripheral clock enabling */ \
                                               tmpreg = READ_REG(RCC->APB4ENR);\
                                               UNUSED(tmpreg); \
                                             } while(0)

#define __HAL_RCC_DTS_CLK_ENABLE()     do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB4ENR, RCC_APB4ENR_DTSEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB4ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_SBS_CLK_DISABLE()     CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_SBSEN)

#define __HAL_RCC_LPUART1_CLK_DISABLE() CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_LPUART1EN)

#define __HAL_RCC_SPI6_CLK_DISABLE()   CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_SPI6EN)

#define __HAL_RCC_LPTIM2_CLK_DISABLE() CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM2EN)

