RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_LPTIM3_CLK_DISABLE() CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM3EN)

#define __HAL_RCC_LPTIM4_CLK_DISABLE() CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM4EN)

#define __HAL_RCC_LPTIM5_CLK_DISABLE() CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM5EN)

#define __HAL_RCC_VREF_CLK_DISABLE()   CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_VREFEN)

#define __HAL_RCC_RTCAPB_CLK_DISABLE()    CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_RTCAPBEN)

#define __HAL_RCC_DTS_CLK_DISABLE()    CLEAR_BIT(RCC->APB4ENR, RCC_APB4ENR_DTSEN)

/**
  * @}
  */

/** @defgroup RCC_APB5_Peripheral_Clock_Enable_Disable APB5 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB5 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_LTDC_CLK_ENABLE()    do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB5ENR, RCC_APB5ENR_LTDCEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_DCMIPP_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB5ENR, RCC_APB5ENR_DCMIPPEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_GFXTIM_CLK_ENABLE()  do { \
                                            __IO uint32_t tmpreg; \
                                            SET_BIT(RCC->APB5ENR, RCC_APB5ENR_GFXTIMEN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_REG(RCC->APB5ENR);\
                                            UNUSED(tmpreg); \
                                          } while(0)

#define __HAL_RCC_LTDC_CLK_DISABLE()   CLEAR_BIT(RCC->APB5ENR, RCC_APB5ENR_LTDCEN)

#define __HAL_RCC_DCMIPP_CLK_DISABLE() CLEAR_BIT(RCC->APB5ENR, RCC_APB5ENR_DCMIPPEN)

#define __HAL_RCC_GFXTIM_CLK_DISABLE() CLEAR_BIT(RCC->APB5ENR, RCC_APB5ENR_GFXTIMEN)

/**
  * @}
  */

/** @defgroup RCC_AHB1_Clock_Enable_Disable_Status AHB1 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB1 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_GPDMA1_IS_CLK_ENABLED()  (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPDMA1EN) != 0U)

#define __HAL_RCC_ADC12_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADC12EN) != 0U)

#if defined(ETH)
#define __HAL_RCC_ETH1MAC_IS_CLK_ENABLED() (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1MACEN) != 0U)

#define __HAL_RCC_ETH1TX_IS_CLK_ENABLED()  (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1TXEN) != 0U)

#define __HAL_RCC_ETH1RX_IS_CLK_ENABLED()  (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETH1RXEN) != 0U)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_IS_CLK_ENABLED() (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN) != 0U)

#define __HAL_RCC_USB_OTG_FS_IS_CLK_ENABLED() (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGFSEN) != 0U)

#define __HAL_RCC_USBPHYC_IS_CLK_ENABLED() (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_USBPHYCEN) != 0U)

#define __HAL_RCC_ADF1_IS_CLK_ENABLED()    (READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ADF1EN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_AHB2_Clock_Enable_Disable_Status AHB2 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB2 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_PSSI_IS_CLK_ENABLED()    (READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_PSSIEN) != 0U)

#define __HAL_RCC_SDMMC2_IS_CLK_ENABLED()  (READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SDMMC2EN) != 0U)

#define __HAL_RCC_CORDIC_IS_CLK_ENABLED()  (READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_CORDICEN) != 0U)

#define __HAL_RCC_SRAM1_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM1EN) != 0U)

#define __HAL_RCC_SRAM2_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM2EN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_AHB3_Clock_Enable_Disable_Status AHB3 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB3 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_RNG_IS_CLK_ENABLED()     (READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_RNGEN) != 0U)

#define __HAL_RCC_HASH_IS_CLK_ENABLED()    (READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_HASHEN) != 0U)

#if defined(CRYP)
#define __HAL_RCC_CRYP_IS_CLK_ENABLED()    (READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_CRYPEN) != 0U)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_IS_CLK_ENABLED()    (READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_SAESEN) != 0U)
#endif /* SAES */

#if defined(PKA)
#define __HAL_RCC_PKA_IS_CLK_ENABLED()     (READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_PKAEN) != 0U)
#endif /* PKA */

/**
  * @}
  */

/** @defgroup RCC_AHB4_Clock_Enable_Disable_Status AHB4 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB4 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_GPIOA_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOAEN) != 0U)

#define __HAL_RCC_GPIOB_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOBEN) != 0U)

#define __HAL_RCC_GPIOC_IS_CLK_ENABLED()   (READ_BIT(RCC->AHB4ENR, RCC_AHB4ENR_GPIOCEN) != 0U)

