RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_USART1_IS_CLK_ENABLED()  (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN) != 0U)

#define __HAL_RCC_SPI1_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN) != 0U)

#define __HAL_RCC_SPI4_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN) != 0U)

#define __HAL_RCC_TIM15_IS_CLK_ENABLED()   (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN) != 0U)

#define __HAL_RCC_TIM16_IS_CLK_ENABLED()   (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN) != 0U)

#define __HAL_RCC_TIM17_IS_CLK_ENABLED()   (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN) != 0U)

#define __HAL_RCC_TIM9_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM9EN) != 0U)

#define __HAL_RCC_SPI5_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI5EN) != 0U)

#define __HAL_RCC_SAI1_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN) != 0U)

#define __HAL_RCC_SAI2_IS_CLK_ENABLED()    (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI2EN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_APB4_Clock_Enable_Disable_Status APB4 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB4 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_SBS_IS_CLK_ENABLED()     (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_SBSEN) != 0U)

#define __HAL_RCC_LPUART1_IS_CLK_ENABLED() (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_LPUART1EN) != 0U)

#define __HAL_RCC_SPI6_IS_CLK_ENABLED()    (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_SPI6EN) != 0U)

#define __HAL_RCC_LPTIM2_IS_CLK_ENABLED()  (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM2EN) != 0U)

#define __HAL_RCC_LPTIM3_IS_CLK_ENABLED()  (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM3EN) != 0U)

#define __HAL_RCC_LPTIM4_IS_CLK_ENABLED()  (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM4EN) != 0U)

#define __HAL_RCC_LPTIM5_IS_CLK_ENABLED()  (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_LPTIM5EN) != 0U)

#define __HAL_RCC_VREF_IS_CLK_ENABLED()    (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_VREFEN) != 0U)

#define __HAL_RCC_RTCAPB_IS_CLK_ENABLED()     (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_RTCAPBEN) != 0U)

#define __HAL_RCC_DTS_IS_CLK_ENABLED()     (READ_BIT(RCC->APB4ENR, RCC_APB4ENR_DTSEN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_APB5_Clock_Enable_Disable_Status APB5 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB5 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_LTDC_IS_CLK_ENABLED()    (READ_BIT(RCC->APB5ENR, RCC_APB5ENR_LTDCEN) != 0U)

#define __HAL_RCC_DCMIPP_IS_CLK_ENABLED()  (READ_BIT(RCC->APB5ENR, RCC_APB5ENR_DCMIPPEN) != 0U)

#define __HAL_RCC_GFXTIM_IS_CLK_ENABLED()  (READ_BIT(RCC->APB5ENR, RCC_APB5ENR_GFXTIMEN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_AHB1_Force_Release_Reset AHB1 Peripheral Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB1_FORCE_RESET()       WRITE_REG(RCC->AHB1RSTR, 0x8E008030UL)
#define __HAL_RCC_AHB1_RELEASE_RESET()     WRITE_REG(RCC->AHB1RSTR, 0UL)

#define __HAL_RCC_GPDMA1_FORCE_RESET()     SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_GPDMA1RST)
#define __HAL_RCC_GPDMA1_RELEASE_RESET()   CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_GPDMA1RST)

#define __HAL_RCC_ADC12_FORCE_RESET()      SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ADC12RST)
#define __HAL_RCC_ADC12_RELEASE_RESET()    CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ADC12RST)

#if defined(ETH)
#define __HAL_RCC_ETH1_FORCE_RESET()       SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ETH1RST)
#define __HAL_RCC_ETH1_RELEASE_RESET()     CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ETH1RST)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_FORCE_RESET()   SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_OTGHSRST)
#define __HAL_RCC_USB_OTG_HS_RELEASE_RESET() CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_OTGHSRST)

#define __HAL_RCC_USB_OTG_FS_FORCE_RESET()   SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_OTGFSRST)
#define __HAL_RCC_USB_OTG_FS_RELEASE_RESET() CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_OTGFSRST)

#define __HAL_RCC_USBPHYC_FORCE_RESET()    SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_USBPHYCRST)
#define __HAL_RCC_USBPHYC_RELEASE_RESET()  CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_USBPHYCRST)

#define __HAL_RCC_ADF1_FORCE_RESET()       SET_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ADF1RST)
#define __HAL_RCC_ADF1_RELEASE_RESET()     CLEAR_BIT(RCC->AHB1RSTR, RCC_AHB1RSTR_ADF1RST)

/**
  * @}
  */

/** @defgroup RCC_AHB2_Force_Release_Reset AHB2 Peripheral Force Release Reset
  * @brief  Force or release AHB2 peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB2_FORCE_RESET()       WRITE_REG(RCC->AHB2RSTR, 0x00004202UL)
#define __HAL_RCC_AHB2_RELEASE_RESET()     WRITE_REG(RCC->AHB2RSTR, 0UL)

#define __HAL_RCC_PSSI_FORCE_RESET()       SET_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_PSSIRST)
#define __HAL_RCC_PSSI_RELEASE_RESET()     CLEAR_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_PSSIRST)

#define __HAL_RCC_SDMMC2_FORCE_RESET()     SET_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_SDMMC2RST)
#define __HAL_RCC_SDMMC2_RELEASE_RESET()   CLEAR_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_SDMMC2RST)

#define __HAL_RCC_CORDIC_FORCE_RESET()     SET_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_CORDICRST)
#define __HAL_RCC_CORDIC_RELEASE_RESET()   CLEAR_BIT(RCC->AHB2RSTR, RCC_AHB2RSTR_CORDICRST)

/**
  * @}
  */

/** @defgroup RCC_AHB3_Force_Release_Reset AHB3 Peripheral Force Release Reset
  * @brief  Force or release AHB3 peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB3_FORCE_RESET()       WRITE_REG(RCC->AHB3RSTR, 0x00000057UL)
#define __HAL_RCC_AHB3_RELEASE_RESET()     WRITE_REG(RCC->AHB3RSTR, 0UL)

#define __HAL_RCC_RNG_FORCE_RESET()        SET_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_RNGRST)
#define __HAL_RCC_RNG_RELEASE_RESET()      CLEAR_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_RNGRST)

#define __HAL_RCC_HASH_FORCE_RESET()       SET_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_HASHRST)
#define __HAL_RCC_HASH_RELEASE_RESET()     CLEAR_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_HASHRST)

#if defined(CRYP)
#define __HAL_RCC_CRYP_FORCE_RESET()       SET_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_CRYPRST)
#define __HAL_RCC_CRYP_RELEASE_RESET()     CLEAR_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_CRYPRST)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_FORCE_RESET()       SET_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_SAESRST)
#define __HAL_RCC_SAES_RELEASE_RESET()     CLEAR_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_SAESRST)
#endif /* SAES */

