RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#if defined(PKA)
#define __HAL_RCC_PKA_FORCE_RESET()        SET_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_PKARST)
#define __HAL_RCC_PKA_RELEASE_RESET()      CLEAR_BIT(RCC->AHB3RSTR, RCC_AHB3RSTR_PKARST)
#endif /* PKA */

/**
  * @}
  */

/** @defgroup RCC_AHB4_Force_Release_Reset AHB4 Peripheral Force Release Reset
  * @brief  Force or release AHB4 peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB4_FORCE_RESET()       WRITE_REG(RCC->AHB4RSTR, 0x0008B0FFUL)
#define __HAL_RCC_AHB4_RELEASE_RESET()     WRITE_REG(RCC->AHB4RSTR, 0UL)

#define __HAL_RCC_GPIOA_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOARST)
#define __HAL_RCC_GPIOA_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOARST)

#define __HAL_RCC_GPIOB_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOBRST)
#define __HAL_RCC_GPIOB_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOBRST)

#define __HAL_RCC_GPIOC_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOCRST)
#define __HAL_RCC_GPIOC_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOCRST)

#define __HAL_RCC_GPIOD_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIODRST)
#define __HAL_RCC_GPIOD_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIODRST)

#define __HAL_RCC_GPIOE_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOERST)
#define __HAL_RCC_GPIOE_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOERST)

#define __HAL_RCC_GPIOF_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOFRST)
#define __HAL_RCC_GPIOF_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOFRST)

#define __HAL_RCC_GPIOG_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOGRST)
#define __HAL_RCC_GPIOG_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOGRST)

#define __HAL_RCC_GPIOH_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOHRST)
#define __HAL_RCC_GPIOH_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOHRST)

#define __HAL_RCC_GPIOM_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOMRST)
#define __HAL_RCC_GPIOM_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOMRST)

#define __HAL_RCC_GPION_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIONRST)
#define __HAL_RCC_GPION_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIONRST)

#define __HAL_RCC_GPIOO_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOORST)
#define __HAL_RCC_GPIOO_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOORST)

#define __HAL_RCC_GPIOP_FORCE_RESET()      SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOPRST)
#define __HAL_RCC_GPIOP_RELEASE_RESET()    CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_GPIOPRST)

#define __HAL_RCC_CRC_FORCE_RESET()        SET_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_CRCRST)
#define __HAL_RCC_CRC_RELEASE_RESET()      CLEAR_BIT(RCC->AHB4RSTR, RCC_AHB4RSTR_CRCRST)

/**
  * @}
  */

/** @defgroup RCC_AHB5_Force_Release_Reset AHB5 Peripheral Force Release Reset
  * @brief  Force or release AHB5 peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB5_FORCE_RESET()       WRITE_REG(RCC->AHB5RSTR, 0x0018513BUL)
#define __HAL_RCC_AHB5_RELEASE_RESET()     WRITE_REG(RCC->AHB5RSTR, 0UL)

#define __HAL_RCC_HPDMA1_FORCE_RESET()     SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_HPDMA1RST)
#define __HAL_RCC_HPDMA1_RELEASE_RESET()   CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_HPDMA1RST)

#define __HAL_RCC_DMA2D_FORCE_RESET()      SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_DMA2DRST)
#define __HAL_RCC_DMA2D_RELEASE_RESET()    CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_DMA2DRST)

#if defined(JPEG)
#define __HAL_RCC_JPEG_FORCE_RESET()       SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_JPEGRST)
#define __HAL_RCC_JPEG_RELEASE_RESET()     CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_JPEGRST)
#endif /* JPEG */

#define __HAL_RCC_FMC_FORCE_RESET()        SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_FMCRST)
#define __HAL_RCC_FMC_RELEASE_RESET()      CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_FMCRST)

#define __HAL_RCC_XSPI1_FORCE_RESET()      SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPI1RST)
#define __HAL_RCC_XSPI1_RELEASE_RESET()    CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPI1RST)

#define __HAL_RCC_SDMMC1_FORCE_RESET()     SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_SDMMC1RST)
#define __HAL_RCC_SDMMC1_RELEASE_RESET()   CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_SDMMC1RST)

#define __HAL_RCC_XSPI2_FORCE_RESET()      SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPI2RST)
#define __HAL_RCC_XSPI2_RELEASE_RESET()    CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPI2RST)

#define __HAL_RCC_XSPIM_FORCE_RESET()   SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPIMRST)
#define __HAL_RCC_XSPIM_RELEASE_RESET() CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_XSPIMRST)

#if defined(GFXMMU)
#define __HAL_RCC_GFXMMU_FORCE_RESET()     SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_GFXMMURST)
#define __HAL_RCC_GFXMMU_RELEASE_RESET()   CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_GFXMMURST)
#endif /* GFXMMU */

#if defined(GPU2D)
#define __HAL_RCC_GPU2D_FORCE_RESET()      SET_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_GPU2DRST)
#define __HAL_RCC_GPU2D_RELEASE_RESET()    CLEAR_BIT(RCC->AHB5RSTR, RCC_AHB5RSTR_GPU2DRST)
#endif /* GPU2D */

/**
  * @}
  */

/** @defgroup RCC_APB1_Force_Release_Reset APB1 Peripheral Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB1_FORCE_RESET()       do { \
                                                WRITE_REG(RCC->APB1RSTR1, 0xC8FFC3FFUL); \
                                                WRITE_REG(RCC->APB1RSTR2, 0x08000122UL); \
                                              } while(0)
#define __HAL_RCC_APB1_RELEASE_RESET()     do { \
                                                WRITE_REG(RCC->APB1RSTR1, 0UL); \
                                                WRITE_REG(RCC->APB1RSTR2, 0UL); \
                                              } while(0)

#define __HAL_RCC_TIM2_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM2RST)
#define __HAL_RCC_TIM2_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM2RST)

#define __HAL_RCC_TIM3_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM3RST)
#define __HAL_RCC_TIM3_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM3RST)

