RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_TIM4_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM4RST)
#define __HAL_RCC_TIM4_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM4RST)

#define __HAL_RCC_TIM5_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM5RST)
#define __HAL_RCC_TIM5_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM5RST)

#define __HAL_RCC_TIM6_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM6RST)
#define __HAL_RCC_TIM6_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM6RST)

#define __HAL_RCC_TIM7_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM7RST)
#define __HAL_RCC_TIM7_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM7RST)

#define __HAL_RCC_TIM12_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM12RST)
#define __HAL_RCC_TIM12_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM12RST)

#define __HAL_RCC_TIM13_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM13RST)
#define __HAL_RCC_TIM13_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM13RST)

#define __HAL_RCC_TIM14_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM14RST)
#define __HAL_RCC_TIM14_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM14RST)

#define __HAL_RCC_LPTIM1_FORCE_RESET()     SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_LPTIM1RST)
#define __HAL_RCC_LPTIM1_RELEASE_RESET()   CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_LPTIM1RST)

#define __HAL_RCC_SPI2_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI2RST)
#define __HAL_RCC_SPI2_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI2RST)

#define __HAL_RCC_SPI3_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI3RST)
#define __HAL_RCC_SPI3_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI3RST)

#define __HAL_RCC_SPDIFRX_FORCE_RESET()    SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPDIFRXRST)
#define __HAL_RCC_SPDIFRX_RELEASE_RESET()  CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPDIFRXRST)

#define __HAL_RCC_USART2_FORCE_RESET()     SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST)
#define __HAL_RCC_USART2_RELEASE_RESET()   CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST)

#define __HAL_RCC_USART3_FORCE_RESET()     SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST)
#define __HAL_RCC_USART3_RELEASE_RESET()   CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST)

#define __HAL_RCC_UART4_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART4RST)
#define __HAL_RCC_UART4_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART4RST)

#define __HAL_RCC_UART5_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART5RST)
#define __HAL_RCC_UART5_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART5RST)

#define __HAL_RCC_I2C1_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1_I3C1RST)
#define __HAL_RCC_I2C1_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1_I3C1RST)

#define __HAL_RCC_I2C2_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C2RST)
#define __HAL_RCC_I2C2_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C2RST)

#define __HAL_RCC_I2C3_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C3RST)
#define __HAL_RCC_I2C3_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C3RST)

#define __HAL_RCC_I3C1_FORCE_RESET()       SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1_I3C1RST)
#define __HAL_RCC_I3C1_RELEASE_RESET()     CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1_I3C1RST)

#define __HAL_RCC_CEC_FORCE_RESET()        SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_CECRST)
#define __HAL_RCC_CEC_RELEASE_RESET()      CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_CECRST)

#define __HAL_RCC_UART7_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART7RST)
#define __HAL_RCC_UART7_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART7RST)

#define __HAL_RCC_UART8_FORCE_RESET()      SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART8RST)
#define __HAL_RCC_UART8_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART8RST)

#define __HAL_RCC_CRS_FORCE_RESET()        SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_CRSRST)
#define __HAL_RCC_CRS_RELEASE_RESET()      CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_CRSRST)

#define __HAL_RCC_MDIOS_FORCE_RESET()      SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_MDIOSRST)
#define __HAL_RCC_MDIOS_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_MDIOSRST)

#define __HAL_RCC_FDCAN_FORCE_RESET()      SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_FDCANRST)
#define __HAL_RCC_FDCAN_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_FDCANRST)

#define __HAL_RCC_UCPD1_FORCE_RESET()      SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_UCPD1RST)
#define __HAL_RCC_UCPD1_RELEASE_RESET()    CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_UCPD1RST)

/**
  * @}
  */

/** @defgroup RCC_APB2_Force_Release_Reset APB2 Peripheral Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB2_FORCE_RESET()       WRITE_REG(RCC->APB2RSTR, 0xC8FFC3FFUL)
#define __HAL_RCC_APB2_RELEASE_RESET()     WRITE_REG(RCC->APB2RSTR, 0UL)

#define __HAL_RCC_TIM1_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM1RST)
#define __HAL_RCC_TIM1_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM1RST)

#define __HAL_RCC_USART1_FORCE_RESET()     SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST)
#define __HAL_RCC_USART1_RELEASE_RESET()   CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST)

#define __HAL_RCC_SPI1_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI1RST)
#define __HAL_RCC_SPI1_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI1RST)

#define __HAL_RCC_SPI4_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI4RST)
#define __HAL_RCC_SPI4_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI4RST)

#define __HAL_RCC_TIM15_FORCE_RESET()      SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM15RST)
#define __HAL_RCC_TIM15_RELEASE_RESET()    CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM15RST)

#define __HAL_RCC_TIM16_FORCE_RESET()      SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM16RST)
#define __HAL_RCC_TIM16_RELEASE_RESET()    CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM16RST)

