RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_TIM17_FORCE_RESET()      SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM17RST)
#define __HAL_RCC_TIM17_RELEASE_RESET()    CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM17RST)

#define __HAL_RCC_TIM9_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM9RST)
#define __HAL_RCC_TIM9_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM9RST)

#define __HAL_RCC_SPI5_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI5RST)
#define __HAL_RCC_SPI5_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI5RST)

#define __HAL_RCC_SAI1_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI1RST)
#define __HAL_RCC_SAI1_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI1RST)

#define __HAL_RCC_SAI2_FORCE_RESET()       SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI2RST)
#define __HAL_RCC_SAI2_RELEASE_RESET()     CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI2RST)

/**
  * @}
  */

/** @defgroup RCC_APB4_Force_Release_Reset APB4 Peripheral Force Release Reset
  * @brief  Force or release APB4 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB4_FORCE_RESET()       WRITE_REG(RCC->APB4RSTR, 0x04009E2AUL)
#define __HAL_RCC_APB4_RELEASE_RESET()     WRITE_REG(RCC->APB4RSTR, 0UL)

#define __HAL_RCC_SBS_FORCE_RESET()        SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_SBSRST)
#define __HAL_RCC_SBS_RELEASE_RESET()      CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_SBSRST)

#define __HAL_RCC_LPUART1_FORCE_RESET()    SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPUART1RST)
#define __HAL_RCC_LPUART1_RELEASE_RESET()  CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPUART1RST)

#define __HAL_RCC_SPI6_FORCE_RESET()       SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_SPI6RST)
#define __HAL_RCC_SPI6_RELEASE_RESET()     CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_SPI6RST)

#define __HAL_RCC_LPTIM2_FORCE_RESET()     SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM2RST)
#define __HAL_RCC_LPTIM2_RELEASE_RESET()   CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM2RST)

#define __HAL_RCC_LPTIM3_FORCE_RESET()     SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM3RST)
#define __HAL_RCC_LPTIM3_RELEASE_RESET()   CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM3RST)

#define __HAL_RCC_LPTIM4_FORCE_RESET()     SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM4RST)
#define __HAL_RCC_LPTIM4_RELEASE_RESET()   CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM4RST)

#define __HAL_RCC_LPTIM5_FORCE_RESET()     SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM5RST)
#define __HAL_RCC_LPTIM5_RELEASE_RESET()   CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_LPTIM5RST)

#define __HAL_RCC_VREF_FORCE_RESET()       SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_VREFRST)
#define __HAL_RCC_VREF_RELEASE_RESET()     CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_VREFRST)

#define __HAL_RCC_DTS_FORCE_RESET()        SET_BIT(RCC->APB4RSTR, RCC_APB4RSTR_DTSRST)
#define __HAL_RCC_DTS_RELEASE_RESET()      CLEAR_BIT(RCC->APB4RSTR, RCC_APB4RSTR_DTSRST)

/**
  * @}
  */

/** @defgroup RCC_APB5_Force_Release_Reset APB5 Peripheral Force Release Reset
  * @brief  Force or release APB5 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB5_FORCE_RESET()       WRITE_REG(RCC->APB5RSTR, 0x00000016UL)
#define __HAL_RCC_APB5_RELEASE_RESET()     WRITE_REG(RCC->APB5RSTR, 0UL)

#define __HAL_RCC_LTDC_FORCE_RESET()       SET_BIT(RCC->APB5RSTR, RCC_APB5RSTR_LTDCRST)
#define __HAL_RCC_LTDC_RELEASE_RESET()     CLEAR_BIT(RCC->APB5RSTR, RCC_APB5RSTR_LTDCRST)

#define __HAL_RCC_DCMIPP_FORCE_RESET()     SET_BIT(RCC->APB5RSTR, RCC_APB5RSTR_DCMIPPRST)
#define __HAL_RCC_DCMIPP_RELEASE_RESET()   CLEAR_BIT(RCC->APB5RSTR, RCC_APB5RSTR_DCMIPPRST)

#define __HAL_RCC_GFXTIM_FORCE_RESET()     SET_BIT(RCC->APB5RSTR, RCC_APB5RSTR_GFXTIMRST)
#define __HAL_RCC_GFXTIM_RELEASE_RESET()   CLEAR_BIT(RCC->APB5RSTR, RCC_APB5RSTR_GFXTIMRST)

/**
  * @}
  */


/** @defgroup RCC_AHB1_Clock_Sleep_Enable_Disable AHB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_GPDMA1_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_GPDMA1LPEN)

#define __HAL_RCC_ADC12_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADC12LPEN)
#if defined(ETH)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1MACLPEN)

#define __HAL_RCC_ETH1TX_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1TXLPEN)

#define __HAL_RCC_ETH1RX_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1RXLPEN)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGHSLPEN)

#define __HAL_RCC_USB_OTG_FS_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGFSLPEN)

#define __HAL_RCC_USBPHYC_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_USBPHYCLPEN)

#define __HAL_RCC_ADF1_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADF1LPEN)


#define __HAL_RCC_GPDMA1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_GPDMA1LPEN)

#define __HAL_RCC_ADC12_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADC12LPEN)

#if defined(ETH)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1MACLPEN)

#define __HAL_RCC_ETH1TX_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1TXLPEN)

#define __HAL_RCC_ETH1RX_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1RXLPEN)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGHSLPEN)

#define __HAL_RCC_USB_OTG_FS_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGFSLPEN)

#define __HAL_RCC_USBPHYC_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_USBPHYCLPEN)

#define __HAL_RCC_ADF1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADF1LPEN)

/**
  * @}
  */

/** @defgroup RCC_AHB2_Clock_Sleep_Enable_Disable AHB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_PSSI_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_PSSILPEN)

