RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_SDMMC2_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SDMMC2LPEN)

#define __HAL_RCC_CORDIC_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_CORDICLPEN)

#define __HAL_RCC_SRAM1_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM1LPEN)

#define __HAL_RCC_SRAM2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM2LPEN)


#define __HAL_RCC_PSSI_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_PSSILPEN)

#define __HAL_RCC_SDMMC2_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SDMMC2LPEN)

#define __HAL_RCC_CORDIC_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_CORDICLPEN)

#define __HAL_RCC_SRAM1_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM1LPEN)

#define __HAL_RCC_SRAM2_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM2LPEN)

/**
  * @}
  */

/** @defgroup RCC_AHB3_Clock_Sleep_Enable_Disable AHB3 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB3 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_RNG_CLK_SLEEP_ENABLE()     SET_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_RNGLPEN)

#define __HAL_RCC_HASH_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_HASHLPEN)

#if defined(CRYP)
#define __HAL_RCC_CRYP_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_CRYPLPEN)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_SAESLPEN)
#endif /* SAES */

#if defined(PKA)
#define __HAL_RCC_PKA_CLK_SLEEP_ENABLE()     SET_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_PKALPEN)
#endif /* PKA */


#define __HAL_RCC_RNG_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_RNGLPEN)

#define __HAL_RCC_HASH_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_HASHLPEN)

#if defined(CRYP)
#define __HAL_RCC_CRYP_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_CRYPLPEN)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_SAESLPEN)
#endif /* SAES */

#if defined(PKA)
#define __HAL_RCC_PKA_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_PKALPEN)
#endif /* PKA */

/**
  * @}
  */

/** @defgroup RCC_AHB4_Clock_Sleep_Enable_Disable AHB4 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB4 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_GPIOA_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOALPEN)

#define __HAL_RCC_GPIOB_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOBLPEN)

#define __HAL_RCC_GPIOC_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOCLPEN)

#define __HAL_RCC_GPIOD_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIODLPEN)

#define __HAL_RCC_GPIOE_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOELPEN)

#define __HAL_RCC_GPIOF_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOFLPEN)

#define __HAL_RCC_GPIOG_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOGLPEN)

#define __HAL_RCC_GPIOH_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOHLPEN)

#define __HAL_RCC_GPIOM_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOMLPEN)

#define __HAL_RCC_GPION_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIONLPEN)

#define __HAL_RCC_GPIOO_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOOLPEN)

#define __HAL_RCC_GPIOP_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOPLPEN)

#define __HAL_RCC_CRC_CLK_SLEEP_ENABLE()     SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_CRCLPEN)

#define __HAL_RCC_BKPRAM_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_BKPRAMLPEN)


#define __HAL_RCC_GPIOA_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOALPEN)

#define __HAL_RCC_GPIOB_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOBLPEN)

#define __HAL_RCC_GPIOC_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOCLPEN)

#define __HAL_RCC_GPIOD_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIODLPEN)

#define __HAL_RCC_GPIOE_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOELPEN)

#define __HAL_RCC_GPIOF_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOFLPEN)

#define __HAL_RCC_GPIOG_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOGLPEN)

#define __HAL_RCC_GPIOH_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOHLPEN)

#define __HAL_RCC_GPIOM_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOMLPEN)

#define __HAL_RCC_GPION_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIONLPEN)

#define __HAL_RCC_GPIOO_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOOLPEN)

#define __HAL_RCC_GPIOP_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_GPIOPLPEN)

#define __HAL_RCC_CRC_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_CRCLPEN)

#define __HAL_RCC_BKPRAM_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB4LPENR, RCC_AHB4LPENR_BKPRAMLPEN)

/**
  * @}
  */

/** @defgroup RCC_AHB5_Clock_Sleep_Enable_Disable AHB5 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

