RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_HPDMA1_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_HPDMA1LPEN)

#define __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DMA2DLPEN)

#define __HAL_RCC_FLASH_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_FLASHLPEN)

#if defined(JPEG)
#define __HAL_RCC_JPEG_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_JPEGLPEN)
#endif /* JPEG */

#define __HAL_RCC_FMC_CLK_SLEEP_ENABLE()     SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_FMCLPEN)

#define __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPI1LPEN)

#define __HAL_RCC_SDMMC1_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_SDMMC1LPEN)

#define __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPI2LPEN)

#define __HAL_RCC_XSPIM_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPIMLPEN)

#if defined(GFXMMU)
#define __HAL_RCC_GFXMMU_CLK_SLEEP_ENABLE()  SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_GFXMMULPEN)
#endif /* GFXMMU */

#if defined(GPU2D)
#define __HAL_RCC_GPU2D_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_GPU2DLPEN)
#endif /* GPU2D */

#define __HAL_RCC_DTCM1_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DTCM1LPEN)

#define __HAL_RCC_DTCM2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DTCM2LPEN)

#define __HAL_RCC_ITCM_CLK_SLEEP_ENABLE()    SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_ITCMLPEN)

#define __HAL_RCC_AXISRAM_CLK_SLEEP_ENABLE() SET_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_AXISRAMLPEN)


#define __HAL_RCC_HPDMA1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_HPDMA1LPEN)

#define __HAL_RCC_DMA2D_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DMA2DLPEN)

#define __HAL_RCC_FLASH_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_FLASHLPEN)

#if defined(JPEG)
#define __HAL_RCC_JPEG_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_JPEGLPEN)
#endif /* JPEG */

#define __HAL_RCC_FMC_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_FMCLPEN)

#define __HAL_RCC_XSPI1_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPI1LPEN)

#define __HAL_RCC_SDMMC1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_SDMMC1LPEN)

#define __HAL_RCC_XSPI2_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPI2LPEN)

#define __HAL_RCC_XSPIM_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_XSPIMLPEN)

#if defined(GFXMMU)
#define __HAL_RCC_GFXMMU_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_GFXMMULPEN)
#endif /* GFXMMU */

#if defined(GPU2D)
#define __HAL_RCC_GPU2D_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_GPU2DLPEN)
#endif /* GPU2D */

#define __HAL_RCC_DTCM1_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DTCM1LPEN)

#define __HAL_RCC_DTCM2_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_DTCM2LPEN)

#define __HAL_RCC_ITCM_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_ITCMLPEN)

#define __HAL_RCC_AXISRAM_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->AHB5LPENR, RCC_AHB5LPENR_AXISRAMLPEN)

/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Sleep_Enable_Disable APB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_TIM2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM2LPEN)

#define __HAL_RCC_TIM3_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM3LPEN)

#define __HAL_RCC_TIM4_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM4LPEN)

#define __HAL_RCC_TIM5_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM5LPEN)

#define __HAL_RCC_TIM6_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM6LPEN)

#define __HAL_RCC_TIM7_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM7LPEN)

#define __HAL_RCC_TIM12_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM12LPEN)

#define __HAL_RCC_TIM13_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM13LPEN)

#define __HAL_RCC_TIM14_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM14LPEN)

#define __HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE() SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_LPTIM1LPEN)

#define __HAL_RCC_WWDG_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_WWDGLPEN)

#define __HAL_RCC_SPI2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPI2LPEN)

#define __HAL_RCC_SPI3_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPI3LPEN)

#define __HAL_RCC_SPDIFRX_CLK_SLEEP_ENABLE() SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPDIFRXLPEN)

#define __HAL_RCC_USART2_CLK_SLEEP_ENABLE() SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_USART2LPEN)

#define __HAL_RCC_USART3_CLK_SLEEP_ENABLE() SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_USART3LPEN)

#define __HAL_RCC_UART4_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART4LPEN)

#define __HAL_RCC_UART5_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART5LPEN)

#define __HAL_RCC_I2C1_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C1_I3C1LPEN)

#define __HAL_RCC_I2C2_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C2LPEN)

#define __HAL_RCC_I2C3_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C3LPEN)

#define __HAL_RCC_I3C1_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C1_I3C1LPEN)

#define __HAL_RCC_CEC_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_CECLPEN)

#define __HAL_RCC_UART7_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART7LPEN)

#define __HAL_RCC_UART8_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART8LPEN)

#define __HAL_RCC_CRS_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_CRSLPEN)

