RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_MDIOS_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_MDIOSLPEN)

#define __HAL_RCC_FDCAN_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_FDCANLPEN)

#define __HAL_RCC_UCPD1_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_UCPD1LPEN)


#define __HAL_RCC_TIM2_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM2LPEN)

#define __HAL_RCC_TIM3_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM3LPEN)

#define __HAL_RCC_TIM4_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM4LPEN)

#define __HAL_RCC_TIM5_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM5LPEN)

#define __HAL_RCC_TIM6_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM6LPEN)

#define __HAL_RCC_TIM7_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM7LPEN)

#define __HAL_RCC_TIM12_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM12LPEN)

#define __HAL_RCC_TIM13_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM13LPEN)

#define __HAL_RCC_TIM14_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_TIM14LPEN)

#define __HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_LPTIM1LPEN)

#define __HAL_RCC_WWDG_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_WWDGLPEN)

#define __HAL_RCC_SPI2_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPI2LPEN)

#define __HAL_RCC_SPI3_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPI3LPEN)

#define __HAL_RCC_SPDIFRX_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_SPDIFRXLPEN)

#define __HAL_RCC_USART2_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_USART2LPEN)

#define __HAL_RCC_USART3_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_USART3LPEN)

#define __HAL_RCC_UART4_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART4LPEN)

#define __HAL_RCC_UART5_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART5LPEN)

#define __HAL_RCC_I2C1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C1_I3C1LPEN)

#define __HAL_RCC_I2C2_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C2LPEN)

#define __HAL_RCC_I2C3_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C3LPEN)

#define __HAL_RCC_I3C1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_I2C1_I3C1LPEN)

#define __HAL_RCC_CEC_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_CECLPEN)

#define __HAL_RCC_UART7_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART7LPEN)

#define __HAL_RCC_UART8_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR1, RCC_APB1LPENR1_UART8LPEN)

#define __HAL_RCC_CRS_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_CRSLPEN)

#define __HAL_RCC_MDIOS_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_MDIOSLPEN)

#define __HAL_RCC_FDCAN_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_FDCANLPEN)

#define __HAL_RCC_UCPD1_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB1LPENR2, RCC_APB1LPENR2_UCPD1LPEN)

/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Sleep_Enable_Disable APB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_TIM1_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM1LPEN)

#define __HAL_RCC_USART1_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_USART1LPEN)

#define __HAL_RCC_SPI1_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI1LPEN)

#define __HAL_RCC_SPI4_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI4LPEN)

#define __HAL_RCC_TIM15_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM15LPEN)

#define __HAL_RCC_TIM16_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM16LPEN)

#define __HAL_RCC_TIM17_CLK_SLEEP_ENABLE()   SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM17LPEN)

#define __HAL_RCC_TIM9_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM9LPEN)

#define __HAL_RCC_SPI5_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI5LPEN)

#define __HAL_RCC_SAI1_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SAI1LPEN)

#define __HAL_RCC_SAI2_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SAI2LPEN)


#define __HAL_RCC_TIM1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM1LPEN)

#define __HAL_RCC_USART1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_USART1LPEN)

#define __HAL_RCC_SPI1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI1LPEN)

#define __HAL_RCC_SPI4_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI4LPEN)

#define __HAL_RCC_TIM15_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM15LPEN)

#define __HAL_RCC_TIM16_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM16LPEN)

#define __HAL_RCC_TIM17_CLK_SLEEP_DISABLE()  CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM17LPEN)

#define __HAL_RCC_TIM9_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_TIM9LPEN)

#define __HAL_RCC_SPI5_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SPI5LPEN)

#define __HAL_RCC_SAI1_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SAI1LPEN)

#define __HAL_RCC_SAI2_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB2LPENR, RCC_APB2LPENR_SAI2LPEN)

/**
  * @}
  */

/** @defgroup RCC_APB4_Clock_Sleep_Enable_Disable APB4 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB4 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_SBS_CLK_SLEEP_ENABLE()     SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_SBSLPEN)

#define __HAL_RCC_LPUART1_CLK_SLEEP_ENABLE() SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPUART1LPEN)

#define __HAL_RCC_SPI6_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_SPI6LPEN)

