RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define __HAL_RCC_LPTIM2_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM2LPEN)

#define __HAL_RCC_LPTIM3_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM3LPEN)

#define __HAL_RCC_LPTIM4_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM4LPEN)

#define __HAL_RCC_LPTIM5_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM5LPEN)

#define __HAL_RCC_VREF_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_VREFLPEN)

#define __HAL_RCC_RTCAPB_CLK_SLEEP_ENABLE()     SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_RTCAPBLPEN)

#define __HAL_RCC_DTS_CLK_SLEEP_ENABLE()     SET_BIT(RCC->APB4LPENR, RCC_APB4LPENR_DTSLPEN)


#define __HAL_RCC_SBS_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_SBSLPEN)

#define __HAL_RCC_LPUART1_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPUART1LPEN)

#define __HAL_RCC_SPI6_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_SPI6LPEN)

#define __HAL_RCC_LPTIM2_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM2LPEN)

#define __HAL_RCC_LPTIM3_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM3LPEN)

#define __HAL_RCC_LPTIM4_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM4LPEN)

#define __HAL_RCC_LPTIM5_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_LPTIM5LPEN)

#define __HAL_RCC_VREF_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_VREFLPEN)

#define __HAL_RCC_RTCAPB_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_RTCAPBLPEN)

#define __HAL_RCC_DTS_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->APB4LPENR, RCC_APB4LPENR_DTSLPEN)

/**
  * @}
  */

/** @defgroup RCC_APB5_Clock_Sleep_Enable_Disable APB5 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB5 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_LTDC_CLK_SLEEP_ENABLE()    SET_BIT(RCC->APB5LPENR, RCC_APB5LPENR_LTDCLPEN)

#define __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB5LPENR, RCC_APB5LPENR_DCMIPPLPEN)

#define __HAL_RCC_GFXTIM_CLK_SLEEP_ENABLE()  SET_BIT(RCC->APB5LPENR, RCC_APB5LPENR_GFXTIMLPEN)


#define __HAL_RCC_LTDC_CLK_SLEEP_DISABLE()   CLEAR_BIT(RCC->APB5LPENR, RCC_APB5LPENR_LTDCLPEN)

#define __HAL_RCC_DCMIPP_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB5LPENR, RCC_APB5LPENR_DCMIPPLPEN)

#define __HAL_RCC_GFXTIM_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->APB5LPENR, RCC_APB5LPENR_GFXTIMLPEN)

/**
  * @}
  */

/** @defgroup RCC_AHB1_Clock_Sleep_Enable_Disable_Status AHB1 Peripheral Clock Sleep Enabled or Disabled Status
  * @brief  Check whether the AHB1 peripheral clock during Low Power (Sleep) mode is enabled or not.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_GPDMA1_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_GPDMA1LPEN) != 0U)

#define __HAL_RCC_ADC12_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADC12LPEN) != 0U)
#if defined(ETH)
#define __HAL_RCC_ETH1MAC_IS_CLK_SLEEP_ENABLED() (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1MACLPEN) != 0U)

#define __HAL_RCC_ETH1TX_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1TXLPEN) != 0U)

#define __HAL_RCC_ETH1RX_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ETH1RXLPEN) != 0U)
#endif /* ETH */

#define __HAL_RCC_USB_OTG_HS_IS_CLK_SLEEP_ENABLED() (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGHSLPEN) != 0U)

#define __HAL_RCC_USB_OTG_FS_IS_CLK_SLEEP_ENABLED() (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_OTGFSLPEN) != 0U)

#define __HAL_RCC_USBPHYC_IS_CLK_SLEEP_ENABLED() (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_USBPHYCLPEN) != 0U)

#define __HAL_RCC_ADF1_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB1LPENR, RCC_AHB1LPENR_ADF1LPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Clock_Sleep_Enable_Disable_Status AHB2 Peripheral Clock Sleep Enabled or Disabled Status
  * @brief  Check whether the AHB2 peripheral clock during Low Power (Sleep) mode is enabled or not.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_PSSI_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_PSSILPEN) != 0U)

#define __HAL_RCC_SDMMC2_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SDMMC2LPEN) != 0U)

#define __HAL_RCC_CORDIC_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_CORDICLPEN) != 0U)

#define __HAL_RCC_SRAM1_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM1LPEN) != 0U)

#define __HAL_RCC_SRAM2_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB2LPENR, RCC_AHB2LPENR_SRAM2LPEN) != 0U)

/**
  * @}
  */

/** @defgroup RCC_AHB3_Clock_Sleep_Enable_Disable_Status AHB3 Peripheral Clock Sleep Enabled or Disabled Status
  * @brief  Check whether the AHB3 peripheral clock during Low Power (Sleep) mode is enabled or not.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_RNG_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_RNGLPEN) != 0U)

#define __HAL_RCC_HASH_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_HASHLPEN) != 0U)

#if defined(CRYP)
#define __HAL_RCC_CRYP_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_CRYPLPEN) != 0U)
#endif /* CRYP */

#if defined(SAES)
#define __HAL_RCC_SAES_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB3LPENR, RCC_AHB3LPENR_SAESLPEN) != 0U)
#endif /* SAES */

