RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
/** @defgroup RCC_RTC_Clock_config RCC_RTC_Clock_config
  * @{
  */

/** @brief  Macros to enable or disable the the RTC clock.
  * @note   These macros must be used only after the RTC clock source was selected.
  */
#define __HAL_RCC_RTC_ENABLE()         SET_BIT(RCC->BDCR, RCC_BDCR_RTCEN)

#define __HAL_RCC_RTC_DISABLE()        CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCEN)

/** @brief  Macros to configure the RTC clock (RTCCLK).
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is denied to this domain after reset, you have to enable write
  *         access using the Power Backup Access macro before to configure
  *         the RTC clock source (to be done once after reset).
  * @note   Once the RTC clock is configured it cannot be changed unless the
  *         Backup domain is reset using __HAL_RCC_BACKUPRESET_FORCE() and
  *         __HAL_RCC_BACKUPRESET_RELEASE() macros, or by a Power On Reset (POR).
  * @param  __RTC_CLKSOURCE__ specifies the RTC clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_RTCCLKSOURCE_LSE      LSE selected as RTC clock.
  *            @arg @ref RCC_RTCCLKSOURCE_LSI      LSI selected as RTC clock.
  *            @arg @ref RCC_RTCCLKSOURCE_HSE_DIV2  HSE divide by 2 selected as RTC clock up to
  *            @arg @ref RCC_RTCCLKSOURCE_HSE_DIV63 for HSE divide by 63
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wakeup source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  */
#define __HAL_RCC_RTC_CLKPRESCALER(__RTC_CLKSOURCE__) \
  ((((__RTC_CLKSOURCE__) & (0x3FU << 12U)) != 0U) ? \
   MODIFY_REG(RCC->CFGR, RCC_CFGR_RTCPRE, (((__RTC_CLKSOURCE__) & (~RCC_BDCR_RTCSEL)) >> 4U)) : \
   CLEAR_BIT(RCC->CFGR, RCC_CFGR_RTCPRE))

#define __HAL_RCC_RTC_CONFIG(__RTC_CLKSOURCE__) \
  do { \
    __HAL_RCC_RTC_CLKPRESCALER(__RTC_CLKSOURCE__); \
    SET_BIT(RCC->BDCR, ((__RTC_CLKSOURCE__) & RCC_BDCR_RTCSEL)); \
  } while(0)

#define __HAL_RCC_GET_RTC_SOURCE() \
  ((READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL) == RCC_BDCR_RTCSEL) ? \
   ((READ_BIT(RCC->CFGR, RCC_CFGR_RTCPRE) << 4U) | RCC_BDCR_RTCSEL) : READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL))

/** @brief  Macros to force or release the Vswitch backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCC_BDCR register.
  * @note   The BKPSRAM is not affected by this reset.
  */
#define __HAL_RCC_BACKUPRESET_FORCE()   SET_BIT(RCC->BDCR, RCC_BDCR_VSWRST)

#define __HAL_RCC_BACKUPRESET_RELEASE() CLEAR_BIT(RCC->BDCR, RCC_BDCR_VSWRST)

/**
  * @}
  */

/** @defgroup RCC_PLL_Clocks_config PLL Clocks configuration
  * @{
  */

/** @brief  Macro to configure the PLLs clock source.
  * @note   This function must be used only when all PLLs are disabled.
  * @param  __PLLSOURCE__ specifies the PLLs entry clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_CSI  CSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_NONE No oscillator clock selected as PLL clock entry (consumption gain)
  */
#define __HAL_RCC_PLLSOURCE_CONFIG(__PLLSOURCE__) \
  MODIFY_REG(RCC->PLLCKSELR, RCC_PLLCKSELR_PLLSRC, (__PLLSOURCE__))

/** @brief  Macro to get the oscillator used as PLL clock source.
  * @retval The oscillator used as PLL clock source.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_CSI  CSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_NONE No oscillator is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL_OSCSOURCE() \
  READ_BIT(RCC->PLLCKSELR, RCC_PLLCKSELR_PLLSRC)

/** @brief  Macros to enable or disable the PLL1.
  * @note   After enabling the main PLL, the application software should wait on
  *         PLL1RDY flag to be set indicating that PLL1 clock is stable and can
  *         be used as system clock source.
  * @note   The main PLL can not be disabled if it is used as system clock source
  * @note   The main PLL is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __HAL_RCC_PLL1_ENABLE()         SET_BIT(RCC->CR, RCC_CR_PLL1ON)

#define __HAL_RCC_PLL1_DISABLE()        CLEAR_BIT(RCC->CR, RCC_CR_PLL1ON)

/**
  * @brief  Enables or disables each clock output (PLL_P_CLK, PLL_Q_CLK, PLL_R_CLK, PLL_S_CLK, PLL_T_CLK)
  * @note   PLL_P_CLK cannot be stopped if used as System Clock
  * @param  __PLL_CLOCKOUT__ specifies the PLL clock to be output
  *          This parameter can be one or a combination of the following values:
  *            @arg @ref RCC_PLL_PCLK This clock is used to generate system clock up to 500MHz
  *            @arg @ref RCC_PLL_QCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_RCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_SCLK This clock is used to generate peripherals clock up to 500MHz
  *
  * @retval None
  */
#define __HAL_RCC_PLL1CLKOUT_ENABLE(__PLL_CLOCKOUT__)   SET_BIT(RCC->PLLCFGR, (__PLL_CLOCKOUT__))

#define __HAL_RCC_PLL1CLKOUT_DISABLE(__PLL_CLOCKOUT__)  CLEAR_BIT(RCC->PLLCFGR, (__PLL_CLOCKOUT__))

/**
  * @brief  Macro to get the PLL1 clock output enable status.
  * @param  __PLL_CLOCKOUT__ specifies the PLL1 clock to be output.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLL_PCLK This clock is used to generate system clock up to 500MHz
  *            @arg @ref RCC_PLL_QCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_RCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_SCLK This clock is used to generate peripherals clock up to 500MHz
  * @retval SET / RESET
  */
#define __HAL_RCC_GET_PLL1CLKOUT_CONFIG(__PLL_CLOCKOUT__)   READ_BIT(RCC->PLLCFGR, (__PLL_CLOCKOUT__))

/**
  * @brief  Enables or disables Fractional Part Of The Multiplication Factor of PLL1 VCO
  * @note   Enabling/disabling  Fractional Part can be any time  without the need to stop the PLL1
  * @retval None
  */
#define __HAL_RCC_PLL1_FRACN_ENABLE()   SET_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLL1FRACEN)

#define __HAL_RCC_PLL1_FRACN_DISABLE()  CLEAR_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLL1FRACEN)

/**
  * @brief  Macro to configure the main PLL clock source, multiplication and division factors.
  * @note   This function must be used only when the main PLL is disabled.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI HSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_CSI CSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_NONE No oscillator clock selected as PLL clock entry (consumption gain)
  * @note   This clock source is common for PLL1, PLL2 and PLL3. It cannot be
  *         change on any PLL if another PLL is already enabled.
  *
  * @param  __PLL1M__ specifies the division factor for PLL VCO input clock
  *          This parameter must be a number between 1 and 63.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 16 MHz.
  *
  * @param  __PLL1N__ specifies the multiplication factor for PLL VCO output clock
  *          This parameter must be a number between 8 and 420.
  * @note   You have to set the PLLN parameter correctly to ensure that the VCO
  *         output frequency is between 150 and 420 MHz (when in medium VCO range) or
  *         between 128 and 560 MHZ (when in wide VCO range)
  *
  * @param  __PLL1P__ specifies the division factor for system  clock.
  *          This parameter must be a number between 1 and 128 (where odd numbers are not allowed)
  *
  * @param  __PLL1Q__ specifies the division factor for peripheral kernel clocks
  *          This parameter must be a number between 1 and 128
  *
  * @param  __PLL1R__ specifies the division factor for peripheral kernel clocks
  *          This parameter must be a number between 1 and 128
  *
  * @param  __PLL1S__ specifies the division factor for peripheral kernel clocks
  *          This parameter must be a number between 1 and 8
  *
  *
  * @note   To insure an optimal behavior of the PLL when one of the post-divider (DIVP, DIVQ,
  *         DIVR, DIVS or DIVT) is not used, application shall clear the enable bit (PLL1yEN)
  *         and assign lowest possible value to  __PLL1P__, __PLL1Q__,  __PLL1R__,  __PLL1S__
  *         or __PLL1T__ parameters.
  * @retval None
  */

#define __HAL_RCC_PLL1_CONFIG(__PLLSOURCE__, __PLL1M__, __PLL1N__, __PLL1P__, __PLL1Q__, __PLL1R__, __PLL1S__) \
  do { \
    MODIFY_REG(RCC->PLLCKSELR, (RCC_PLLCKSELR_PLLSRC | RCC_PLLCKSELR_DIVM1) , ((__PLLSOURCE__) | ( (__PLL1M__) << RCC_PLLCKSELR_DIVM1_Pos)));  \
    WRITE_REG(RCC->PLL1DIVR1, ((((__PLL1N__) - 1U) & RCC_PLL1DIVR1_DIVN) | \
                               ((((__PLL1P__) - 1U) << RCC_PLL1DIVR1_DIVP_Pos) & RCC_PLL1DIVR1_DIVP) | \
                               ((((__PLL1Q__) - 1U) << RCC_PLL1DIVR1_DIVQ_Pos) & RCC_PLL1DIVR1_DIVQ) | \
                               ((((__PLL1R__) - 1U) << RCC_PLL1DIVR1_DIVR_Pos) & RCC_PLL1DIVR1_DIVR))); \
    MODIFY_REG(RCC->PLL1DIVR2, RCC_PLL1DIVR2_DIVS, \
               (((__PLL1S__) - 1U) & RCC_PLL1DIVR2_DIVS)); \
  } while(0)

/**
  * @brief  Macro to configures the PLL1 clock Fractional Part Of The Multiplication Factor
  *
  * @note   These bits can be written at any time, allowing dynamic fine-tuning of the PLL1 VCO
  *
  * @param  __PLL1FRACN__ specifies Fractional Part Of The Multiplication Factor for PLL1 VCO.
  *                       It should be a value between 0 and 8191
  * @note   Warning: The software has to set correctly these bits to insure that the VCO
  *                  output frequency is between its valid frequency range, which is:
  *                   128 to 560 MHz if PLL1VCOSEL = 0
  *                   150 to 420 MHz if PLL1VCOSEL = 1.
  *
  * @retval None
  */
#define  __HAL_RCC_PLL1_FRACN_CONFIG(__PLL1FRACN__) \
  MODIFY_REG(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACN, (uint32_t)(__PLL1FRACN__) << RCC_PLL1FRACR_FRACN_Pos)

/** @brief  Macro to select the PLL1 reference frequency range.
  * @param  __PLL_VCOINPUT_RANGE__ specifies the PLL1 input frequency range
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLL_VCOINPUT_RANGE0 Range frequency is between 1 and 2 MHz
  *            @arg @ref RCC_PLL_VCOINPUT_RANGE1 Range frequency is between 2 and 4 MHz
  *            @arg @ref RCC_PLL_VCOINPUT_RANGE2 Range frequency is between 4 and 8 MHz
  *            @arg @ref RCC_PLL_VCOINPUT_RANGE3 Range frequency is between 8 and 16 MHz
  *
  * @retval None
  */
#define __HAL_RCC_PLL1_VCOINPUT_RANGE(__PLL_VCOINPUT_RANGE__) \
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLL1RGE, (__PLL_VCOINPUT_RANGE__))

/** @brief  Macro to select the PLL1 reference frequency range.
  * @param  __PLLVCORANGE__ specifies the PLL1 input frequency range
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLL_VCO_HIGH   Range frequency is between 128 to 560 MHz
  *            @arg @ref RCC_PLL_VCO_LOW    Range frequency is between 150 and 420 MHz
  * @retval None
  */
#define __HAL_RCC_PLL1_VCORANGE(__PLLVCORANGE__) \
  MODIFY_REG(RCC->PLLCFGR, RCC_PLLCFGR_PLL1VCOSEL, (__PLLVCORANGE__))

/** @brief  Macros to enable or disable PLL2.
  * @note   After enabling PLL2, the application software should wait on
  *         PLL2RDY flag to be set indicating that PLL2 clock is stable and can
  *         be used as kernel clock source.
  * @note   PLL2 is disabled by hardware when entering Stop and Standby modes.
  */
#define __HAL_RCC_PLL2_ENABLE()         SET_BIT(RCC->CR, RCC_CR_PLL2ON)
#define __HAL_RCC_PLL2_DISABLE()        CLEAR_BIT(RCC->CR, RCC_CR_PLL2ON)

/**
  * @brief  Enables or disables each clock output (PLL2_P_CLK, PLL2_Q_CLK, PLL2_R_CLK, PLL2_S_CLK, PLL2_T_CLK)
  * @param  __PLL_CLOCKOUT__ Specifies the PLL2 clock(s) to be output
  *          This parameter can be one or a combination of the following values:
  *            @arg @ref RCC_PLL_PCLK This clock is used to generate system clock up to 500MHz
  *            @arg @ref RCC_PLL_QCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_RCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_SCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_TCLK This clock is used to generate peripherals clock up to 500MHz
  * @retval None
  */
#define __HAL_RCC_PLL2CLKOUT_ENABLE(__PLL_CLOCKOUT__)   SET_BIT(RCC->PLLCFGR, ((__PLL_CLOCKOUT__) << (RCC_PLLCFGR_PLL2PEN_Pos - RCC_PLLCFGR_PLL1PEN_Pos)))

#define __HAL_RCC_PLL2CLKOUT_DISABLE(__PLL_CLOCKOUT__)  CLEAR_BIT(RCC->PLLCFGR, ((__PLL_CLOCKOUT__) << (RCC_PLLCFGR_PLL2PEN_Pos - RCC_PLLCFGR_PLL1PEN_Pos)))

/**
  * @brief  Macro to get the PLL2 clock output enable status.
  * @param  __PLL_CLOCKOUT__ specifies the PLL2 clock to be output.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLL_PCLK This clock is used to generate system clock up to 500MHz
  *            @arg @ref RCC_PLL_QCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_RCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_SCLK This clock is used to generate peripherals clock up to 500MHz
  *            @arg @ref RCC_PLL_TCLK This clock is used to generate peripherals clock up to 500MHz
  * @retval SET / RESET
  */
#define __HAL_RCC_GET_PLL2CLKOUT_CONFIG(__PLL_CLOCKOUT__)   (READ_BIT(RCC->PLLCFGR, ((__PLL_CLOCKOUT__) << (RCC_PLLCFGR_PLL2PEN_Pos - RCC_PLLCFGR_PLL1PEN_Pos))) \
                                                             >> (RCC_PLLCFGR_PLL2PEN_Pos - RCC_PLLCFGR_PLL1PEN_Pos))

/**
  * @brief  Enables or disables Fractional Part Of The Multiplication Factor of PLL2 VCO
  * @note   Enabling/disabling  Fractional Part can be any time  without the need to stop the PLL2
  * @retval None
  */
#define __HAL_RCC_PLL2_FRACN_ENABLE()   SET_BIT(RCC->PLLCFGR, RCC_PLLCFGR_PLL2FRACEN)

