RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc.h
#define IS_RCC_LSE_DRIVE(__DRIVE__)             (((__DRIVE__) == RCC_LSEDRIVE_LOW)        || \
                                                 ((__DRIVE__) == RCC_LSEDRIVE_MEDIUMLOW)  || \
                                                 ((__DRIVE__) == RCC_LSEDRIVE_MEDIUMHIGH) || \
                                                 ((__DRIVE__) == RCC_LSEDRIVE_HIGH))

#define IS_RCC_FLAG(__FLAG__) (((__FLAG__) == RCC_FLAG_HSIRDY)  || ((__FLAG__) == RCC_FLAG_HSIDIV )  || \
                               ((__FLAG__) == RCC_FLAG_CSIRDY)  || ((__FLAG__) == RCC_FLAG_HSI48RDY) || \
                               ((__FLAG__) == RCC_FLAG_HSERDY)  || ((__FLAG__) == RCC_FLAG_PLL1RDY)  || \
                               ((__FLAG__) == RCC_FLAG_PLL2RDY) || ((__FLAG__) == RCC_FLAG_PLL3RDY)  || \
                               ((__FLAG__) == RCC_FLAG_LSERDY)  || ((__FLAG__) == RCC_FLAG_LSECSSD)  || \
                               ((__FLAG__) == RCC_FLAG_LSIRDY)  || ((__FLAG__) == RCC_FLAG_BORRST)   || \
                               ((__FLAG__) == RCC_FLAG_PINRST)  || ((__FLAG__) == RCC_FLAG_PORRST)   || \
                               ((__FLAG__) == RCC_FLAG_SFTRST)  || ((__FLAG__) == RCC_FLAG_IWDGRST)  || \
                               ((__FLAG__) == RCC_FLAG_WWDGRST) || ((__FLAG__) == RCC_FLAG_LPWRRST))

#define IS_RCC_HSICALIBRATION_VALUE(__VALUE__) ((__VALUE__) <= 0x7FU)

#define IS_RCC_CSICALIBRATION_VALUE(__VALUE__) ((__VALUE__) <= 0x3FU)

#define IS_RCC_STOP_WAKEUPCLOCK(__SOURCE__) (((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_CSI) || \
                                             ((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_HSI))

#define IS_RCC_STOP_KERWAKEUPCLOCK(__SOURCE__) (((__SOURCE__) == RCC_STOP_KERWAKEUPCLOCK_CSI) || \
                                                ((__SOURCE__) == RCC_STOP_KERWAKEUPCLOCK_HSI))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_HAL_RCC_H */
